#include "Speed/Indep/Src/EAXSound/Stream/SndStrmWrapper.hpp"
#include "Speed/Indep/Libs/realcore/include/common/realcore/system.h"

struct STREAMCHUNKHDR {
    int type; // offset 0x0, size 0x4
    int size; // offset 0x4, size 0x4
};

struct REQUESTSTRUCTtag;
struct TAPSTRUCTtag;
struct FILTERSTRUCTtag;
struct STREAMHEADERtag;

typedef enum READTYPE {
    FILEREAD = 0,
    MEMREAD = 1,
} READTYPE;

typedef enum STREAMREQUESTSTATE {
    STREAMREQUEST_FREE = 0,
    STREAMREQUEST_PENDING = 1,
    STREAMREQUEST_EXECUTING = 2,
    STREAMREQUEST_COMPLETED = 3,
    STREAMREQUEST_CANCELED = 4,
} STREAMREQUESTSTATE;

typedef enum STREAMSTATE {
    STREAM_IDLE_STATE = 0,
    STREAM_RUNNING_STATE = 1,
    STREAM_STOPPED_STATE = 2,
} STREAMSTATE;

// total size: 0x124
typedef struct REQUESTSTRUCTtag {
    int id;                          // offset 0x0, size 0x4
    STREAMREQUESTSTATE state;        // offset 0x4, size 0x4
    REQUESTSTRUCTtag *prev;         // offset 0x8, size 0x4
    REQUESTSTRUCTtag *next;         // offset 0xC, size 0x4
    READTYPE type;                   // offset 0x10, size 0x4
    char fname[255];                 // offset 0x14, size 0xFF
    char *address;                   // offset 0x114, size 0x4
    int parm;                        // offset 0x118, size 0x4
    int endchunkid;                  // offset 0x11C, size 0x4
    char *datastart;                 // offset 0x120, size 0x4
} REQUESTSTRUCT;

// total size: 0x10
typedef struct TAPSTRUCTtag {
    STREAMHEADERtag *stream; // offset 0x0, size 0x4
    int tapnum;              // offset 0x4, size 0x4
    int gettable;            // offset 0x8, size 0x4
    char *getptr;            // offset 0xC, size 0x4
} TAPSTRUCT;

// total size: 0xC
typedef struct FILTERSTRUCTtag {
    int mask;   // offset 0x0, size 0x4
    int value;  // offset 0x4, size 0x4
    int tapnum; // offset 0x8, size 0x4
} FILTERSTRUCT;

// total size: 0x18C
typedef struct STREAMHEADERtag {
    int id;                    // offset 0x0, size 0x4
    MUTEX mutex;               // offset 0x4, size 0x1C
    REQUESTSTRUCT *request;    // offset 0x20, size 0x4
    int requests;              // offset 0x24, size 0x4
    FILTERSTRUCT *filter;      // offset 0x28, size 0x4
    int filters;               // offset 0x2C, size 0x4
    TAPSTRUCT *tap;            // offset 0x30, size 0x4
    int taps;                  // offset 0x34, size 0x4
    char *actualbufferstart;   // offset 0x38, size 0x4
    char *bufferstart;         // offset 0x3C, size 0x4
    char *bufferend;           // offset 0x40, size 0x4
    volatile STREAMSTATE state; // offset 0x44, size 0x4
    int prioritylow;           // offset 0x48, size 0x4
    int priorityhigh;          // offset 0x4C, size 0x4
    int greedylevel;           // offset 0x50, size 0x4
    int greedystate;           // offset 0x54, size 0x4
    int bufferusage;           // offset 0x58, size 0x4
    char *datastart;           // offset 0x5C, size 0x4
    char *datatail;            // offset 0x60, size 0x4
    char *dataend;             // offset 0x64, size 0x4
    REQUESTSTRUCT *firstreq;   // offset 0x68, size 0x4
    REQUESTSTRUCT *curreq;     // offset 0x6C, size 0x4
    REQUESTSTRUCT *lastreq;    // offset 0x70, size 0x4
    REQUESTSTRUCT *freereq;    // offset 0x74, size 0x4
    char fname[255];           // offset 0x78, size 0xFF
    int fhandle;               // offset 0x178, size 0x4
    int foffset;               // offset 0x17C, size 0x4
    int fop;                   // offset 0x180, size 0x4
    int readsize;              // offset 0x184, size 0x4
    int readblocksize;         // offset 0x188, size 0x4
} STREAMHEADER;

typedef char StreamRequestSizeCheck[(sizeof(REQUESTSTRUCT) == 0x124) ? 1 : -1];
typedef char StreamTapSizeCheck[(sizeof(TAPSTRUCT) == 0x10) ? 1 : -1];
typedef char StreamFilterSizeCheck[(sizeof(FILTERSTRUCT) == 0xC) ? 1 : -1];
typedef char StreamHeaderSizeCheck[(sizeof(STREAMHEADER) == 0x18C) ? 1 : -1];

inline int ReadChunkWord(const int *field) {
    const unsigned char *bytes = static_cast<const unsigned char *>(static_cast<const void *>(field));
    return (static_cast<int>(bytes[3]) << 24) | (static_cast<int>(bytes[2]) << 16) | (static_cast<int>(bytes[1]) << 8) |
           static_cast<int>(bytes[0]);
}

inline unsigned int little_get(const void *src, int n) {
    return (static_cast<const unsigned char *>(src)[3] << 24) |
           (static_cast<const unsigned char *>(src)[2] << 16) |
           (static_cast<const unsigned char *>(src)[1] << 8) |
           static_cast<const unsigned char *>(src)[0];
}

