// OWNED BY zFeOverlay AGENT
#include "Speed/Indep/Src/Frontend/MenuScreens/Safehouse/customize/CustomizeManager.hpp"
#include "Speed/Indep/Src/Frontend/Database/FEDatabase.hpp"
#include "Speed/Indep/Src/Frontend/FEManager.hpp"
#include "Speed/Indep/Src/Misc/EasterEggs.hpp"
#include "Speed/Indep/Src/Physics/PhysicsUpgrades.hpp"
#include "Speed/Indep/Src/World/CarInfo.hpp"
#include "Speed/Indep/Src/Frontend/Careers/UnlockSystem.hpp"
#include "Speed/Indep/Src/Physics/PhysicsInfo.hpp"

namespace Physics {
namespace Upgrades {
    bool CanInstallJunkman(const Attrib::Gen::pvehicle &pvehicle, Type type);
    void SetLevel(Attrib::Gen::pvehicle &pvehicle, Type type, int level);
}
}

extern CarTypeInfo *GetCarTypeInfoFromHash(unsigned int hash);

extern FEMarkerManager TheFEMarkerManager;

extern int g_bTestCareerCustomization;
extern int g_bCustomizeManagerHasControl;
extern SelectablePart *_8Showcase_FromColor;
extern float gTradeInFactor;
extern int CustomizeIsInBackRoom();
extern CarPart *GetCarPart(RideInfo *ride, unsigned int slot_id);

struct CarPartAttribute;
struct CarPart {
    unsigned short PartNameHashBot;         // offset 0x0, size 0x2
    unsigned short PartNameHashTop;         // offset 0x2, size 0x2
    char PartID;                            // offset 0x4, size 0x1
    unsigned char GroupNumber_UpgradeLevel;  // offset 0x5, size 0x1
    char BaseModelNameHashSelector;         // offset 0x6, size 0x1
    unsigned char CarTypeNameHashIndex;     // offset 0x7, size 0x1
    unsigned short NameOffset;              // offset 0x8, size 0x2
    unsigned short AttributeTableOffset;    // offset 0xA, size 0x2
    unsigned short ModelNameHashTableOffset; // offset 0xC, size 0x2

    const char *GetName();
    unsigned int GetCarTypeNameHash();
    unsigned int GetPartNameHash();
    char GetPartID();
    char GetUpgradeLevel();
    char GetGroupNumber() { return GroupNumber_UpgradeLevel & 0x1f; }
    int HasAppliedAttribute(unsigned int namehash);
    const char *GetAppliedAttributeString(unsigned int namehash, const char *default_string);
    float GetAppliedAttributeFParam(unsigned int namehash, float default_value);
    int GetAppliedAttributeIParam(unsigned int namehash, int default_value);
    unsigned int GetAppliedAttributeUParam(unsigned int namehash, unsigned int default_value);
    unsigned int GetBrandNameHash();
};

int CarCustomizeManager::GetNumPackages(Physics::Upgrades::Type type) {
    return Physics::Upgrades::GetMaxLevel(ThePVehicle, type);
}

bool CarCustomizeManager::CanInstallJunkman(Physics::Upgrades::Type type) {
