#include "Speed/Indep/Src/World/CarRenderConn.h"
#include "Speed/Indep/Src/Sim/SimServer.h"
#include "Speed/Indep/Src/World/VehicleRenderConn.h"
#include "Speed/Indep/Src/World/Skids.hpp"
#include "Speed/Indep/Libs/Support/Utility/FastMem.h"
#include "Speed/Indep/Src/Interfaces/SimActivities/INIS.h"
#include "Speed/Indep/Src/Physics/PhysicsInfo.hpp"
#include "Speed/Indep/Src/Sim/SimSurface.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/simsurface.h"
#include "Speed/Indep/Src/Ecstasy/EcstasyData.hpp"
#include "Speed/Indep/Src/Ecstasy/EmitterSystem.h"
#include "Speed/Indep/Libs/Support/Utility/UMath.h"
#include "Speed/Indep/bWare/Inc/bTypes.hpp"

#ifdef EA_PLATFORM_GAMECUBE
#include "Speed/GameCube/Src/xSparks.h"
#else
// TODO
#include "Speed/PSX2/Src/xSparks.h"
#endif

// TODO these are in Render.hpp in carbon, do we want that to exist here?
extern unsigned int numCopsActiveView;
extern float renderModifier;

static const float Tweak_MaxCarAnimTime = 10.0f;

struct TireState;

bTList<TireState> gTireStateList;

struct TireState : public bTNode<TireState> {
    struct Effect {
        Effect()
            : mNeedsLazyInit(false), //
              mEmitterKey(0),        //
              mGroup(nullptr),       //
              mMinVel(0.0f),         //
              mMaxVel(0.0f)          //
#ifndef EA_BUILD_A124
              ,
              mZeroParticleFrameCount(0)
#endif
        {
        }

        void ResetGroup() {
            mGroup = nullptr;
            mEmitterKey = 0;
            mMinVel = 0.0f;
            mNeedsLazyInit = true;
#ifndef EA_BUILD_A124
            mZeroParticleFrameCount = 0;
#endif
            mMaxVel = 0.0f;
        }

#ifndef EA_BUILD_A124
        void FreeUpFX();
#endif
        void LazyInit();
        void Set(const TireEffectRecord &record);
        void Update(float speed, const bVector3 *car_velocity, const bMatrix4 *car_matrix, float dT, const bVector4 &pos);

        bool mNeedsLazyInit;     // offset 0x0, size 0x1
        Attrib::Key mEmitterKey; // offset 0x4, size 0x4
        EmitterGroup *mGroup;    // offset 0x8, size 0x4
        float mMinVel;           // offset 0xC, size 0x4
        float mMaxVel;           // offset 0x10, size 0x4
#ifndef EA_BUILD_A124
        int mZeroParticleFrameCount; // offset 0x14, size 0x4
#endif
    };

    TireState();

    ~TireState();

    USE_FASTALLOC(TireState)

    void UpdateWorld(const WCollider *wc, bool rain, bool flat);

    void KillSkids();

    void DoFX(float slip, float skid, float speed, const bVector3 *car_velocity, const bMatrix4 *car_matrix, float dT);

    void DoSkids(float intensity, const bVector3 *deltaPos, const bMatrix4 *tirematrix, const bMatrix4 *bodymatrix, float SkidWidth);

    bVector4 mPrevTirePos; // offset 0x8, size 0x10
    WWorldPos mWPos;       // offset 0x18, size 0x3C
    SkidMaker mSkidMaker;  // offset 0x54, size 0x4
    bVector4 mTirePos;     // offset 0x58, size 0x10
    bVector4 mGroundPos;   // offset 0x68, size 0x10
    float mRoll;           // offset 0x78, size 0x4
    bool mRaining;         // offset 0x7C, size 0x1
    bool mFlat;            // offset 0x80, size 0x1
    SimSurface mSurface;   // offset 0x84, size 0x14
    Effect mSlipFX;        // offset 0x98, size 0x18
    Effect mSkidFX;        // offset 0xB0, size 0x18
    Effect mDriveFX;       // offset 0xC8, size 0x18

  private:
    void SetSurface(const SimSurface &surface);
};

void NotifyTireStateEffectOfEmitterDelete(void *tire_state_effect, EmitterGroup *grp) {
    TireState::Effect *effect = static_cast<TireState::Effect *>(tire_state_effect);
    effect->ResetGroup();
}

void KillSkidsOnRaceRestart() {
    for (TireState *ts = gTireStateList.GetHead(); ts != gTireStateList.EndOfList(); ts = ts->GetNext()) {
        ts->KillSkids();
    }

    DeleteAllSkids();
}

#ifndef EA_BUILD_A124
void TireState::Effect::FreeUpFX() {
    if (this->mGroup != nullptr) {
        this->mGroup->SetOldSurfaceEffectFlag();
        this->mGroup->UnSubscribe();
    }

    this->mGroup = nullptr;
    this->mNeedsLazyInit = true;
    this->mZeroParticleFrameCount = 0;
}
#endif

void TireState::Effect::LazyInit() {
    if (this->mGroup != nullptr) {
        this->mGroup->SetOldSurfaceEffectFlag();
        this->mGroup->UnSubscribe();
    }

