#include "./CarRender.hpp"
#include "Interfaces/IVehicleDamageBehaviour.h"
#include "Speed/Indep/Libs/Support/Utility/UTypes.h"
#include "Speed/Indep/Src/Ecstasy/DefragFixer.hpp"
#include "Speed/Indep/Src/Ecstasy/Ecstasy.hpp"
#include "Speed/Indep/Src/Ecstasy/eEnvMap.hpp"
#include "Speed/Indep/Src/Ecstasy/eStrip.hpp"
#include "Speed/Indep/Src/Ecstasy/EcstasyData.hpp"
#include "Speed/Indep/Src/Ecstasy/EcstasyE.hpp"
#include "Speed/Indep/Src/Ecstasy/Texture.hpp"
#include "Speed/Indep/Src/Ecstasy/eLight.hpp"
#include "Speed/Indep/Src/Ecstasy/eMath.hpp"
#include "Speed/Indep/Src/Camera/CameraMover.hpp"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/ecar.h"
#include "Speed/Indep/Src/Interfaces/SimEntities/IPlayer.h"
#include "Speed/Indep/Src/Interfaces/SimActivities/INIS.h"
#include "Speed/Indep/Src/Interfaces/Simables/IRigidBody.h"
#include "Speed/Indep/Src/Main/AttribSupport.h"
#include "Speed/Indep/Src/Frontend/FEManager.hpp"
#include "Speed/Indep/Src/Misc/BuildRegion.hpp"
#include "Speed/Indep/Src/Misc/GameFlow.hpp"
#include "Speed/Indep/Src/Misc/Profiler.hpp"
#include "Speed/Indep/Src/Sim/Simulation.h"
#include "Speed/Indep/Src/World/Car.hpp"
#include "Speed/Indep/Src/World/CarInfo.hpp"
#include "Speed/Indep/Src/World/CarPartID.h"
#include "Speed/Indep/Src/World/Player.hpp"
#include "Speed/Indep/Src/World/Sun.hpp"
#include "Speed/Indep/Src/World/VehicleFragmentConn.h"
#include "Speed/Indep/Src/World/VehiclePartDamage.h"
#include "Speed/Indep/Src/World/VehicleRenderConn.h"
#include "Speed/Indep/bWare/Inc/Strings.hpp"
#include "Speed/Indep/bWare/Inc/bMath.hpp"
#include "Speed/Indep/bWare/Inc/bMemory.hpp"
#include "Speed/Indep/bWare/Inc/bSlotPool.hpp"
#include "Speed/Indep/bWare/Inc/bTypes.hpp"
#include "Speed/Indep/bWare/Inc/bWare.hpp"
#include "VehicleFX.h"
#include <cmath>

// int32 DrawLightFlares; // why is this here in the dwarfs? shouldn't it be in eLight?

static const int RenderShaperRigLightIndicators = 0;
static const float ShaperLightsIndicatorDistanceFromCar = 1.5f;
static const float ShaperLightsIndicatorSize = 0.075f;

static const CAR_SLOT_ID BreakOnModelInitCarSlotId = CARSLOTID_BASE;
static const CAR_SLOT_ID BreakOnSetModelCarSlotId = CARSLOTID_BASE;
static const CAR_SLOT_ID BreakOnRenderCarSlotId = CARSLOTID_BASE;

// STRIPPED
const char *GetCarRenderUsageString(CarRenderUsage usage) {}

float culldiv = 12000.0f;

enum eCullableCarParts {
    CULLABLE_CAR_PART_TIRE_FL = 0,
    CULLABLE_CAR_PART_TIRE_FR = 1,
    CULLABLE_CAR_PART_TIRE_RR = 2,
    CULLABLE_CAR_PART_TIRE_RL = 3,
    CULLABLE_CAR_PART_BRAKE_FL = 4,
    CULLABLE_CAR_PART_BRAKE_FR = 5,
    CULLABLE_CAR_PART_BRAKE_RR = 6,
    CULLABLE_CAR_PART_BRAKE_RL = 7,
    CULLABLE_CAR_PART_SIDE_FRONT = 8,
    CULLABLE_CAR_PART_SIDE_REAR = 9,
    CULLABLE_CAR_PART_UNDERNEATH = 10,
    NUM_CULLABLE_CAR_PARTS = 11,
};

enum eCullingPolarity {
    CULLING_POLARITY_ANY_VISIBLE = 0,
    CULLING_POLARITY_ALL_MUST_BE_VISIBLE = 1,
};

enum CarEffectPosition {
    CARFXPOS_NONE = 0,
    CARFXPOS_FRONT_TIRES = 1,
    CARFXPOS_REAR_TIRES = 2,
    CARFXPOS_LEFT_TIRES = 3,
    CARFXPOS_RIGHT_TIRES = 4,
    CARFXPOS_TIRE_FL = 5,
    CARFXPOS_TIRE_FR = 6,
    CARFXPOS_TIRE_RR = 7,
    CARFXPOS_TIRE_RL = 8,
    CARFXPOS_ENGINE = 9,
    CARFXPOS_EXHAUST = 10,
    CARFXPOS_RADIATOR = 11,
    CARFXPOS_WINDSHIELD = 12,
    CARFXPOS_WINDOW_REAR = 13,
    CARFXPOS_WINDOW_LEFT_FRONT = 14,
    CARFXPOS_WINDOW_LEFT_REAR = 15,
    CARFXPOS_WINDOW_RIGHT_FRONT = 16,
    CARFXPOS_WINDOW_RIGHT_REAR = 17,
    CARFXPOS_HEADLIGHT = 18,
    CARFXPOS_HEADLIGHT_LEFT = 19,
    CARFXPOS_HEADLIGHT_RIGHT = 20,
    CARFXPOS_BRAKELIGHT = 21,
    CARFXPOS_BRAKELIGHT_LEFT = 22,
    CARFXPOS_BRAKELIGHT_RIGHT = 23,
    CARFXPOS_SIDE_MIRROR_LEFT = 24,
    CARFXPOS_SIDE_MIRROR_RIGHT = 25,
    CARFXPOS_LICENSE_PLATE_FRONT = 26,
    CARFXPOS_LICENSE_PLATE_REAR = 27,
    NUM_CARFXPOS = 28,
};

static const int MAX_NUM_MARKERS_PER_CARFXPOS = 0; // TODO value

struct CarFXPosInfo {
    unsigned int position_marker_hashes[4]; // offset 0x0, size 0x10
    unsigned char marker_count;             // offset 0x10, size 0x1
};

static const CarFXPosInfo FXMarkerNameHashMappings[28] = {
    {{0, 0, 0, 0}, 255},
    {{0, 0, 0, 0}, 255},
    {{0, 0, 0, 0}, 255},
    {{0, 0, 0, 0}, 255},
    {{0, 0, 0, 0}, 255},
    {{0, 0, 0, 0}, 255},
    {{0, 0, 0, 0}, 255},
    {{0, 0, 0, 0}, 255},
    {{0, 0, 0, 0}, 255},
    {{0, 0, 0, 0}, 255},
    {{STRINGHASH_EXHAUST, STRINGHASH_LEFT_EXHAUST, STRINGHASH_RIGHT_EXHAUST, 0}, 3},
    {{0, 0, 0, 0}, 0},
    {{0, 0, 0, 0}, 0},
    {{0, 0, 0, 0}, 0},
    {{0, 0, 0, 0}, 0},
    {{0, 0, 0, 0}, 0},
    {{0, 0, 0, 0}, 0},
    {{0, 0, 0, 0}, 0},
    {{0, 0, 0, 0}, 0},
    {{0, 0, 0, 0}, 0},
    {{0, 0, 0, 0}, 0},
    {{0, 0, 0, 0}, 0},
    {{0, 0, 0, 0}, 0},
    {{0, 0, 0, 0}, 0},
    {{0, 0, 0, 0}, 0},
    {{0, 0, 0, 0}, 0},
    {{0, 0, 0, 0}, 0},
    {{0, 0, 0, 0}, 0},
};

bool GetNumCarEffectMarkerHashes(CarEffectPosition fx_pos, int &count_out) {
    bool position_marker_based_fxpos = false;
    count_out = 0;
    if (FXMarkerNameHashMappings[fx_pos].marker_count != 255) {
        count_out = FXMarkerNameHashMappings[fx_pos].marker_count;
        position_marker_based_fxpos = true;
    }

    return position_marker_based_fxpos;
}

const unsigned int *GetCarEffectMarkerHashes(CarEffectPosition fx_pos) {
    return reinterpret_cast<const unsigned int *>(&FXMarkerNameHashMappings[fx_pos].marker_count);
}

struct CarPartCullingPlaneInfo {
  public:
    CarPartCullingPlaneInfo(eCullableCarParts type, char *name, eCullingPolarity polarity, int numPlanes, const bVector3 &normal0,
                            const bVector3 &normal1, const bVector3 &normal2, float nd0, float nd1, float nd2) {
        this->Type = type;
        this->Name = name;
        this->Polarity = polarity;
        this->NumPlanes = numPlanes;

        this->Normal[0] = normal0;
        this->Normal[1] = normal1;
        this->Normal[2] = normal2;

        this->NormalDistance[0] = nd0;
        this->NormalDistance[1] = nd1;
        this->NormalDistance[2] = nd2;
    }

    eCullableCarParts Type;    // offset 0x0, size 0x4
    char *Name;                // offset 0x4, size 0x4
    eCullingPolarity Polarity; // offset 0x8, size 0x4
    int NumPlanes;             // offset 0xC, size 0x4
    bVector3 Normal[3];        // offset 0x10, size 0x30
    float NormalDistance[3];   // offset 0x40, size 0xC
};

struct CarPartInfo {
    bVector3 Position;       // offset 0x0, size 0x10
    int NumCulledNotVisible; // offset 0x10, size 0x4
    int NumCulledVisible;    // offset 0x14, size 0x4
    bool IsVisible;          // offset 0x18, size 0x1
};

CarPartCullingPlaneInfo CarPartCullingPlaneInfoTable[11] = {
    CarPartCullingPlaneInfo(CULLABLE_CAR_PART_TIRE_FL, "CULLABLE_CAR_PART_TIRE_FL", CULLING_POLARITY_ANY_VISIBLE, 3, bVector3(-0.01f, -1.0f, 0.0f),
                            bVector3(0.0f, 0.0f, 1.0f), bVector3(-0.707f, 0.0f, 0.707f), 0.1f, 0.42, -0.298f),
    CarPartCullingPlaneInfo(CULLABLE_CAR_PART_TIRE_FR, "CULLABLE_CAR_PART_TIRE_FR", CULLING_POLARITY_ANY_VISIBLE, 3, bVector3(-0.01f, 1.0f, 0.0f),
                            bVector3(0.0f, 0.0f, 1.0f), bVector3(-0.707f, 0.0f, 0.707f), 0.1f, 0.42f, -0.298f),
    CarPartCullingPlaneInfo(CULLABLE_CAR_PART_TIRE_RR, "CULLABLE_CAR_PART_TIRE_RR", CULLING_POLARITY_ANY_VISIBLE, 3, bVector3(0.01f, 1.0f, 0.0f),
                            bVector3(0.0f, 0.0f, 1.0f), bVector3(0.707f, 0.0f, 0.707f), 0.1f, 0.42f, -0.298f),
    CarPartCullingPlaneInfo(CULLABLE_CAR_PART_TIRE_RL, "CULLABLE_CAR_PART_TIRE_RL", CULLING_POLARITY_ANY_VISIBLE, 3, bVector3(0.01f, -1.0f, 0.0f),
                            bVector3(0.0f, 0.0f, 1.0f), bVector3(0.707f, 0.0f, 0.707f), 0.1f, 0.42f, -0.298f),
    CarPartCullingPlaneInfo(CULLABLE_CAR_PART_BRAKE_FL, "CULLABLE_CAR_PART_BRAKE_FL", CULLING_POLARITY_ALL_MUST_BE_VISIBLE, 2,
                            bVector3(0.22f, -1.0f, 0.0f), bVector3(-0.22f, -1.0f, 0.0f), bVector3(-0.22f, -1.0f, 0.0f), 0.0f, 0.05f, 0.0f),
    CarPartCullingPlaneInfo(CULLABLE_CAR_PART_BRAKE_FR, "CULLABLE_CAR_PART_BRAKE_FR", CULLING_POLARITY_ALL_MUST_BE_VISIBLE, 2,
                            bVector3(0.22f, 1.0f, 0.0f), bVector3(-0.22f, 1.0f, 0.0f), bVector3(-0.22f, -1.0f, 0.0f), 0.0f, 0.05f, 0.0f),
    CarPartCullingPlaneInfo(CULLABLE_CAR_PART_BRAKE_RR, "CULLABLE_CAR_PART_BRAKE_RR", CULLING_POLARITY_ALL_MUST_BE_VISIBLE, 2,
                            bVector3(0.22f, 1.0f, 0.0f), bVector3(-0.22f, 1.0f, 0.0f), bVector3(-0.22f, -1.0f, 0.0f), 0.0f, 0.05f, 0.0f),
    CarPartCullingPlaneInfo(CULLABLE_CAR_PART_BRAKE_RL, "CULLABLE_CAR_PART_BRAKE_RL", CULLING_POLARITY_ALL_MUST_BE_VISIBLE, 2,
                            bVector3(0.22f, -1.0f, 0.0f), bVector3(-0.22f, -1.0f, 0.0f), bVector3(-0.22f, -1.0f, 0.0f), 0.0f, 0.05f, 0.0f),
    CarPartCullingPlaneInfo(CULLABLE_CAR_PART_SIDE_FRONT, "CULLABLE_CAR_PART_SIDE_FRONT", CULLING_POLARITY_ANY_VISIBLE, 1,
                            bVector3(-1.0f, 0.0f, 0.0f), bVector3(-1.0f, 0.0f, 0.0f), bVector3(-1.0f, 0.0f, 0.0f), 0.0f, 0.0f, 0.0f),
    CarPartCullingPlaneInfo(CULLABLE_CAR_PART_SIDE_REAR, "CULLABLE_CAR_PART_SIDE_REAR", CULLING_POLARITY_ANY_VISIBLE, 1, bVector3(1.0f, 0.0f, 0.0f),
                            bVector3(-1.0f, 0.0f, 0.0f), bVector3(-1.0f, 0.0f, 0.0f), 0.0f, 0.0f, 0.0f),
    CarPartCullingPlaneInfo(CULLABLE_CAR_PART_UNDERNEATH, "CULLABLE_CAR_PART_UNDERNEATH", CULLING_POLARITY_ALL_MUST_BE_VISIBLE, 2,
                            bVector3(-0.07f, 0.0f, 1.0f), bVector3(0.07f, 0.0f, 1.0f), bVector3(0.07f, 0.0f, 1.0f), 0.05f, 0.05f, 0.0f),
};

class CarPartCuller {
  public:
    CarPartCuller() {
        bMemSet(this, 0, sizeof(*this));
    }

    void InitPart(eCullableCarParts type, const bVector3 *position);
    void CullParts(bVector3 *camera_eye, bAngle stang);
    void RenderPart(eCullableCarParts type, eView *view, const bMatrix4 *local_world, bAngle stang);

    bool IsPartVisible(eCullableCarParts type) {
        return CarPartInfoTable[type].IsVisible;
    }

  private:
    CarPartInfo CarPartInfoTable[11];
};

static const eCullableCarParts CurrentCarPartCullingType = CULLABLE_CAR_PART_TIRE_FL; // TODO fix value

const CarPartCullingPlaneInfo *pCurrentPartCullingPlaneInfo = nullptr;

static const int DisableCarPartCulling = 0;

int my_xyz = 1;
int xyzhmm = 0;
int neghmm = 0;

void CarPartCuller::InitPart(eCullableCarParts type, const bVector3 *position) {
    CarPartCullingPlaneInfo *plane_info = &CarPartCullingPlaneInfoTable[type];
    CarPartInfo *part_info = &this->CarPartInfoTable[type];

    for (int n = 0; n < plane_info->NumPlanes; n++) {
        if (bAbs(1.0f - bLength(&plane_info->Normal[n])) > 0.01f) {
            bNormalize(&plane_info->Normal[n], &plane_info->Normal[n]);
        }
    }

    part_info->Position = *position;
}

// UNSOLVED
void CarPartCuller::RenderPart(eCullableCarParts type, eView *view, const bMatrix4 *local_world, unsigned short stang) {}

// UNSOLVED, weird debug_print stuff
void CarPartCuller::CullParts(bVector3 *camera_eye, bAngle stang) {
    ProfileNode profile_node("TODO", 0);
    bVector3 Modcamera_eye = *camera_eye;
    bVector3 *unModcamera_eyeP = camera_eye;
    bMatrix4 turnMat;

    if (stang != 0) {
        eIdentity(&turnMat);
        eRotateZ(&turnMat, &turnMat, -stang);
        eMulVector(&Modcamera_eye, &turnMat, camera_eye);
    }

    for (eCullableCarParts type = CULLABLE_CAR_PART_TIRE_FL; type < NUM_CULLABLE_CAR_PARTS;
         type = static_cast<eCullableCarParts>(static_cast<int>(type) + 1)) {
        bool visible = true;
        CarPartCullingPlaneInfo *plane_info = &CarPartCullingPlaneInfoTable[type];
        CarPartInfo *part_info = &this->CarPartInfoTable[type];
        float omodifier = plane_info->NormalDistance[0];
        float modifier;

        if (!IsGameFlowInFrontEnd()) {
            // TODO
            camera_eye = (static_cast<unsigned int>(type) - 4 > 1) ? unModcamera_eyeP : &Modcamera_eye;

            if (type <= CULLABLE_CAR_PART_TIRE_FR) {
                if (stang > 0x8000) {
                    stang = -stang;
                }

                modifier = static_cast<float>(stang) / culldiv;
                plane_info->NormalDistance[0] = omodifier + modifier;
            } else {
                plane_info->NormalDistance[0] = omodifier;
            }

            if (plane_info->NumPlanes > 0) {
                bVector3 v = *camera_eye - part_info->Position;
                int debug_print = 0;

                if (plane_info->Polarity == CULLING_POLARITY_ANY_VISIBLE) {
                    debug_print = plane_info->NumPlanes;
                    int n = 0;

                    for (; n < plane_info->NumPlanes; n++) {
                        bVector3 normal = plane_info->Normal[n];

                        if (pCurrentPartCullingPlaneInfo != nullptr) {
                            bNormalize(&normal, &normal);
                        }

                        float distance = bDot(&v, &normal) - plane_info->NormalDistance[n];
                        debug_print = plane_info->NumPlanes;
                        if (distance < 0.0f) {
                            break;
                        }
                    }

                    if (n == debug_print) {
                        visible = false;
                    }
                } else if (plane_info->Polarity == CULLING_POLARITY_ALL_MUST_BE_VISIBLE) {
                    for (int n = 0; n < plane_info->NumPlanes; n++) {
                        bVector3 normal = plane_info->Normal[n];

                        if (pCurrentPartCullingPlaneInfo != nullptr) {
                            bNormalize(&normal, &normal);
                        }

                        float distance = bDot(&v, &normal) - plane_info->NormalDistance[n];
                        if (distance >= 0.0f) {
                            visible = false;
                            break;
                        }
                    }
                }
            }
        }

        part_info->IsVisible = visible;
        plane_info->NormalDistance[0] = omodifier;

        if (visible) {
            part_info->NumCulledVisible++;
        } else {
            part_info->NumCulledNotVisible++;
        }
    }
}

extern SlotPool *CarEmitterPositionSlotPool;

const int MAX_CAR_PART_MODELS = 250;
SlotPool *CarPartModelPool = nullptr;

class CarEmitterPosition : public bSNode<CarEmitterPosition> {
  public:
    USE_SLOTALLOC(CarEmitterPositionSlotPool);

    CarEmitterPosition(ePositionMarker *position_marker) {
        PositionMarker = position_marker;
        X = position_marker->Matrix.v3.x;
        Y = position_marker->Matrix.v3.y;
        Z = position_marker->Matrix.v3.z;
    }

    CarEmitterPosition(float x, float y, float z) {
        PositionMarker = nullptr;
        X = x;
        Y = y;
        Z = z;
    }

    float X;                         // offset 0x4, size 0x4
    float Y;                         // offset 0x8, size 0x4
    float Z;                         // offset 0xC, size 0x4
    ePositionMarker *PositionMarker; // offset 0x10, size 0x4
};

uint32 CarLightsStateMap[5] = {1, 2, 4, 8, 16};
uint32 CarReplacementDecalHash[26] = {
    bStringHash("BOTTOM_DECAL"),
    bStringHash("FRONT_BUMPER_DECAL"),
    bStringHash("FRONT_DECAL"),
    bStringHash("GTWING_DECAL"),
    bStringHash("HOOD_DECAL"),
    bStringHash("LEFT_BRAKELIGHT_DECAL"),
    bStringHash("LEFT_DOOR_DECAL"),
    bStringHash("LEFT_FENDER_DECAL"),
    bStringHash("LEFT_QUARTER_DECAL"),
    bStringHash("LEFT_SIDE_MIRROR_DECAL"),
    bStringHash("LEFT_SKIRT_DECAL"),
    bStringHash("REAR_BUMPER_DECAL"),
    bStringHash("REAR_DECAL"),
    bStringHash("RIGHT_BRAKELIGHT_DECAL"),
    bStringHash("RIGHT_DOOR_DECAL"),
    bStringHash("RIGHT_FENDER_DECAL"),
    bStringHash("RIGHT_QUARTER_DECAL"),
    bStringHash("RIGHT_SIDE_MIRROR_DECAL"),
    bStringHash("RIGHT_SKIRT_DECAL"),
    bStringHash("TOP_DECAL"),
    bStringHash("FRONT_WINDOW_DECAL"),
    bStringHash("REAR_WINDOW_DECAL"),
    bStringHash("LEFT_FRONT_WINDOW_DECAL"),
    bStringHash("LEFT_REAR_WINDOW_DECAL"),
    bStringHash("RIGHT_FRONT_WINDOW_DECAL"),
    bStringHash("RIGHT_REAR_WINDOW_DECAL"),
};

static const int NUM_TRUNK_AUDIO_MARKERS = 0; // TODO fix the value

unsigned int gTrunkAudioMarkerHash[12] = {
    bStringHash("MARKER_AUDIO_COMP_0"), bStringHash("MARKER_AUDIO_COMP_1"), bStringHash("MARKER_AUDIO_COMP_2"),  bStringHash("MARKER_AUDIO_COMP_3"),
    bStringHash("MARKER_AUDIO_COMP_4"), bStringHash("MARKER_AUDIO_COMP_5"), bStringHash("MARKER_AUDIO_COMP_6"),  bStringHash("MARKER_AUDIO_COMP_7"),
    bStringHash("MARKER_AUDIO_COMP_8"), bStringHash("MARKER_AUDIO_COMP_9"), bStringHash("MARKER_AUDIO_COMP_10"), bStringHash("MARKER_AUDIO_COMP_11"),
};

float NISCopCarDoorOpenAmount[4];
bMatrix4 NISCopCarDoorOpenMarkers[4];
bMatrix4 NISCopCarDoorClosedMarkers[4];

void SetNISCopCarDoorOpenAmount(CarRenderDoorID door, float open_amount) {}

int NISCopCarDriverVisible = 0;

void SetNISCopCarDriverVisible(int visible) {}

int NISRaceDriverVisible = 1;

void SetNISRaceDriverVisible(int visible) {
    NISRaceDriverVisible = visible;
}

class CarPartModel {
  public:
    CarPartModel() {
        this->mModel = 0;
    }

    ~CarPartModel() {
        this->mModel = 0;
    }

    void Clear() {
        mModel = 0;
    }

    int IsHidden() {
        return this->mModel & 1;
    }

    void Hide(int bHide) {
        mModel = (mModel & ~3) | (bHide ? 1 : 0);
    }

    struct eModel *GetModel() {
        return reinterpret_cast<eModel *>(mModel & ~0x3);
    }

    void SetModel(struct eModel *model) {
        this->mModel = reinterpret_cast<unsigned int>(model) | this->IsHidden();
    }

    bool IsLodMissing() const {
        return (mModel & ~3u) == 0;
    }

  private:
    uint32 mModel; // offset 0x0, size 0x4
};

static const float Tweak_ResetFlashOff = 0.05f;
static const float Tweak_ResetFlashOn = 0.07f;

class CarRenderInfo {
  public:
    enum CarReplacementTexID {
        REPLACETEX_CARSKIN,
        REPLACETEX_CARSKINB,
        REPLACETEX_GLOBALSKIN,
        REPLACETEX_CARBONSKIN,
        REPLACETEX_GLOBALCARBONSKIN,
        REPLACETEX_BADGING,
        REPLACETEX_WHEEL,
        REPLACETEX_SPINNER,
        REPLACETEX_SPOILER,
        REPLACETEX_ROOF_SCOOP,
        REPLACETEX_DASHSKIN,
        REPLACETEX_DRIVER,
        REPLACETEX_TIRE,
        REPLACETEX_WINDOW_FRONT,
        REPLACETEX_WINDOW_REAR,
        REPLACETEX_WINDOW_LEFT_FRONT,
        REPLACETEX_WINDOW_LEFT_REAR,
        REPLACETEX_WINDOW_RIGHT_FRONT,
        REPLACETEX_WINDOW_RIGHT_REAR,
        REPLACETEX_WINDOW_REAR_DEFOST,
        REPLACETEX_WINDOW2_FRONT,
        REPLACETEX_WINDOW2_REAR,
        REPLACETEX_WINDOW2_LEFT_FRONT,
        REPLACETEX_WINDOW2_LEFT_REAR,
        REPLACETEX_WINDOW2_RIGHT_FRONT,
        REPLACETEX_WINDOW2_RIGHT_REAR,
        REPLACETEX_WINDOW2_REAR_DEFOST,
        REPLACETEX_HEADLIGHT_LEFT,
        REPLACETEX_HEADLIGHT_RIGHT,
        REPLACETEX_BRAKELIGHT_LEFT,
        REPLACETEX_BRAKELIGHT_RIGHT,
        REPLACETEX_BRAKELIGHT_CENTRE,
        REPLACETEX_HEADLIGHT_GLASS_LEFT,
        REPLACETEX_HEADLIGHT_GLASS_RIGHT,
        REPLACETEX_BRAKELIGHT_GLASS_LEFT,
        REPLACETEX_BRAKELIGHT_GLASS_RIGHT,
        REPLACETEX_BRAKELIGHT_GLASS_CENTRE,
        REPLACETEX_OLD_HEADLIGHT_LEFT,
        REPLACETEX_OLD_HEADLIGHT_RIGHT,
        REPLACETEX_OLD_BRAKELIGHT_LEFT,
        REPLACETEX_OLD_BRAKELIGHT_RIGHT,
        REPLACETEX_OLD_BRAKELIGHT_CENTRE,
        REPLACETEX_OLD_HEADLIGHT_GLASS_LEFT,
        REPLACETEX_OLD_HEADLIGHT_GLASS_RIGHT,
        REPLACETEX_OLD_BRAKELIGHT_GLASS_LEFT,
        REPLACETEX_OLD_BRAKELIGHT_GLASS_RIGHT,
        REPLACETEX_OLD_BRAKELIGHT_GLASS_CENTRE,
        REPLACETEX_BOTTOM_DECAL,
        REPLACETEX_FRONT_BUMPER_DECAL,
        REPLACETEX_FRONT_DECAL,
        REPLACETEX_GTWING_DECAL,
        REPLACETEX_HOOD_DECAL,
        REPLACETEX_LEFT_BRAKELIGHT_DECAL,
        REPLACETEX_LEFT_DOOR_DECAL,
        REPLACETEX_LEFT_FENDER_DECAL,
        REPLACETEX_LEFT_QUARTER_DECAL,
        REPLACETEX_LEFT_SIDE_MIRROR_DECAL,
        REPLACETEX_LEFT_SKIRT_DECAL,
        REPLACETEX_REAR_BUMPER_DECAL,
        REPLACETEX_REAR_DECAL,
        REPLACETEX_RIGHT_BRAKELIGHT_DECAL,
        REPLACETEX_RIGHT_DOOR_DECAL,
        REPLACETEX_RIGHT_FENDER_DECAL,
        REPLACETEX_RIGHT_QUARTER_DECAL,
        REPLACETEX_RIGHT_SIDE_MIRROR_DECAL,
        REPLACETEX_RIGHT_SKIRT_DECAL,
        REPLACETEX_TOP_DECAL,
        REPLACETEX_FRONT_WINDOW_DECAL,
        REPLACETEX_REAR_WINDOW_DECAL,
        REPLACETEX_LEFT_FRONT_WINDOW_DECAL,
        REPLACETEX_LEFT_REAR_WINDOW_DECAL,
        REPLACETEX_RIGHT_FRONT_WINDOW_DECAL,
        REPLACETEX_RIGHT_REAR_WINDOW_DECAL,
        REPLACETEX_DECAL_START = 47,
        REPLACETEX_DECAL_END = 72,
        REPLACETEX_DECAL_NUM = 26,
        REPLACETEX_NUM = 73,
    };

    CarRenderInfo(RideInfo *ride_info);

    ~CarRenderInfo();

    void Init();
    void Refresh();

    uint32 FindCarPart(int slotId);
    uint32 HideCarPart(int slotId, bool hide);

    void SetDeltaTime(float dt) {
        this->mDeltaTime = dt;
    }

    float GetDeltaTime() const {
        return this->mDeltaTime;
    }

    void SetCarDamageState(bool on, unsigned int startID, unsigned int endID);
    void SetCarGlassDamageState(bool on, CarReplacementTexID replacementId, uint32 undamageHash, uint32 damageHash);

    void UpdateCarReplacementTextures();
    void UpdateLightStateTextures();
    void CreateCarLightFlares();

    void SetRadius(float r) {
        this->mRadius = r;
    }

    float GetRadius() const {
        return this->mRadius;
    }

    void SetCollider(const WCollider *collider) {
        this->mWCollider = collider;
    }

    void SetAnimationTime(float animationTime) {
        this->AnimTime = animationTime;
    }

    void SetWheelWobble(unsigned int wheelInd, bool enable) {
        this->mWheelWobbleEnabled[wheelInd] = enable;
    }

    bool GetWheelWobble(unsigned int wheelInd) {
        return this->mWheelWobbleEnabled[wheelInd];
    }

    void SetFlashing(bool b) {
        this->mFlashing = b;
    }

    void UpdateFlashing() {
        if (this->mFlashing) {
            this->mFlashInterval += RealTimeElapsed;

            if (Tweak_ResetFlashOff < this->mFlashInterval) {
                this->mFlashInterval -= Tweak_ResetFlashOn + Tweak_ResetFlashOff;
            }
        }
    }

    bool Render(eView *view, const bVector3 *world_position, const bMatrix4 *body_matrix, bMatrix4 *tire_matrices, bMatrix4 *brake_matrices,
                bMatrix4 *spinner_matrices, uint32 extra_render_flags, int force_light_state, int reflexion, float shadow_scale, CARPART_LOD tireLOD,
                CARPART_LOD carLOD);

    void DrawAmbientShadow(eView *view, const bVector3 *position, float shadow_scale, bMatrix4 *localWorld, bMatrix4 *worldLocal,
                           bMatrix4 *biasedIdentity);

    void DrawKeithProjShadow(eView *view, const bVector3 *position, bMatrix4 *localWorld, bMatrix4 *worldLocal, bMatrix4 *biasedIdentity,
                             int body_lod);

    void SetCarRenderFlags(int draw_solid, int draw_alpha, int draw_shadows) {}

    void RenderFlaresOnCar(eView *view, const bVector3 *position, const bMatrix4 *body_matrix, int force_light_state, int reflexion,
                           int renderFlareFlags);
    void RenderTextureHeadlights(eView *view, bMatrix4 *l_w, uint32 Accurate);
    void SwitchSkin(RideInfo *ride_info);
    void UpdateDecalTextures(RideInfo *ride_info);
    void UpdateCarParts();

    void UpdateWheelYRenderOffset();

    float CalculateTireBlur(int nWheel);
    void RenderTireBlur(eView *view, TextureInfo *texture_info, bMatrix4 *local_world, float alpha, eDynamicLightContext *light_context);

    void SetSpecialFX(int fx) {
        this->SpecialFX = fx;
    }

    int GetSpecialFX() {
        return this->SpecialFX;
    }

    RideInfo *GetRideInfo() const {
        return this->pRideInfo;
    }

    void SetDamageInfo(const DamageZone::Info &damageInfo);
    void SetPlayerDamage(const DamageZone::Info &damageInfo);

    CARPART_LOD GetMinLodLevel() const {
        return this->mMinLodLevel;
    }

    CARPART_LOD GetMaxLodLevel() const {
        return this->mMaxLodLevel;
    }

    CARPART_LOD GetMinReflectionLodLevel() const {
        return this->mMinReflectionLodLevel;
    }

    void GetLightPositions(bSList<CarEmitterPosition> &pos, uint32 position);
    int GetEmitterPositions(bSList<CarEmitterPosition> &markers_out, const unsigned int *position_name_hashes, int num_pos_name_hashes);
    void InitEmitterPositions(bVector4 *tire_positions);

    void EnableAlphaWrites(bool onOff) {}

    const Attrib::Gen::ecar &GetAttributes() const {
        return this->mAttributes;
    }

    void SetBrokenLights(unsigned int vehiclefx_ids) {
        this->mBrokenLights = vehiclefx_ids;
    }

    void SetLights(unsigned int vehiclefx_ids) {
        this->mOnLights = vehiclefx_ids;
    }

    bool IsLightBroken(VehicleFX::ID id) const {
        return (this->mBrokenLights & id) != 0;
    }

    bool IsLightOn(VehicleFX::ID id) const {
        return (this->mOnLights & id) != 0;
    }

    void RenderPart(eView *view, CarPartModel *carPart, bMatrix4 *local_to_world, eDynamicLightContext *light_context, uint32 flags);
    void convex_hull(bVector3 *p, const WCollider *wcoll, int &n, float Z, float zBias, int fast);

    float AnimTime;                                                         // offset 0x0, size 0x4
    bVector3 mVelocity;                                                     // offset 0x4, size 0x10
    bVector3 mAngularVelocity;                                              // offset 0x14, size 0x10
    bVector3 mAcceleration;                                                 // offset 0x24, size 0x10
    IVehiclePartDamageBehaviour *mDamageBehaviour;                          // offset 0x34, size 0x4
    const WCollider *mWCollider;                                            // offset 0x38, size 0x4
    WWorldPos mWorldPos;                                                    // offset 0x3C, size 0x3C
    RideInfo *pRideInfo;                                                    // offset 0x78, size 0x4
    CarTypeInfo *pCarTypeInfo;                                              // offset 0x7C, size 0x4
    int16 LastCarPartChanged;                                               // offset 0x80, size 0x2
    bVector3 AABBMin;                                                       // offset 0x84, size 0x10
    bVector3 AABBMax;                                                       // offset 0x94, size 0x10
    bVector3 ModelOffset;                                                   // offset 0xA4, size 0x10
    bVector3 PivotPosition;                                                 // offset 0xB4, size 0x10
    TextureInfo *ShadowTexture;                                             // offset 0xC4, size 0x4
    TextureInfo *ShadowRampTexture;                                         // offset 0xC8, size 0x4
    eLightMaterial *LightMaterial_CarSkin;                                  // offset 0xCC, size 0x4
    eLightMaterial *LightMaterial_Carbon;                                   // offset 0xD0, size 0x4
    eLightMaterial *LightMaterial_WindowTint;                               // offset 0xD4, size 0x4
    eLightMaterial *LightMaterial_WheelRim;                                 // offset 0xD8, size 0x4
    eLightMaterial *LightMaterial_Caliper;                                  // offset 0xDC, size 0x4
    eLightMaterial *LightMaterial_Spoiler;                                  // offset 0xE0, size 0x4
    eLightMaterial *LightMaterial_Roof;                                     // offset 0xE4, size 0x4
    eLightMaterial *LightMaterial_Spinner;                                  // offset 0xE8, size 0x4
    int CarbonHood;                                                         // offset 0xEC, size 0x4
    eDynamicLightContext *Car_light_context;                                // offset 0xF0, size 0x4
    uint32 CarFrame;                                                        // offset 0xF4, size 0x4
    bTList<eLightFlare> LightFlareList;                                     // offset 0xF8, size 0x8
    float CarTimebaseStart;                                                 // offset 0x100, size 0x4
    float WheelYRenderOffset[4];                                            // offset 0x104, size 0x10
    float WheelWidths[2];                                                   // offset 0x114, size 0x8
    float WheelRadius[2];                                                   // offset 0x11C, size 0x8
    float WheelWidthScales[4];                                              // offset 0x124, size 0x10
    float WheelRadiusScales[4];                                             // offset 0x134, size 0x10
    float WheelBrakeMarkerY[2];                                             // offset 0x144, size 0x8
    bool mEmitterPositionsInitialized;                                      // offset 0x14C, size 0x1
    bSList<CarEmitterPosition> EmitterPositionList[28];                     // offset 0x150, size 0xE0
    eReplacementTextureTable MasterReplacementTextureTable[73];             // offset 0x230, size 0x36C
    eReplacementTextureTable CarbonReplacementTextureTable[73];             // offset 0x59C, size 0x36C
    eReplacementTextureTable DecalReplacementTextureTable[48];              // offset 0x908, size 0x240
    eReplacementTextureTable BrakeLeftReplacementTextureTable[2];           // offset 0xB48, size 0x18
    eReplacementTextureTable BrakeRightReplacementTextureTable[2];          // offset 0xB60, size 0x18
    CarPartModel mCarPartModels[CARSLOTID_MODEL_NUM][CARPART_MODEL_NUM][5]; // offset 0xB78, size 0x5F0
    int SpecialFX;                                                          // offset 0x1168, size 0x4
    float mCar_elevation;                                                   // offset 0x116C, size 0x4
    int NOSstate;                                                           // offset 0x1170, size 0x4
    bAngle mSteeringR;                                                      // offset 0x1174, size 0x2
    bAngle mSteeringL;                                                      // offset 0x1176, size 0x2
    bMatrix4 LastFewMatrices[3];                                            // offset 0x1178, size 0xC0
    bVector3 LastFewPositions[3];                                           // offset 0x1238, size 0x30
    int matrixIndex;                                                        // offset 0x1268, size 0x4
    ePositionMarker *SpoilerPositionMarker;                                 // offset 0x126C, size 0x4
    ePositionMarker *SpoilerPositionMarker2;                                // offset 0x1270, size 0x4
    ePositionMarker *RoofScoopPositionMarker;                               // offset 0x1274, size 0x4
    uint32 AAflags;                                                         // offset 0x1278, size 0x4
    int AAdraw_solid;                                                       // offset 0x127C, size 0x4
    int AAdraw_alpha;                                                       // offset 0x1280, size 0x4
    int AAdraw_shadows;                                                     // offset 0x1284, size 0x4

  private:
    UsedCarTextureInfo mUsedTextureInfos; // offset 0x1288, size 0x380
    unsigned int mOnLights;               // offset 0x1608, size 0x4
    unsigned int mBrokenLights;           // offset 0x160C, size 0x4
    CARPART_LOD mMinLodLevel;             // offset 0x1610, size 0x4
    CARPART_LOD mMaxLodLevel;             // offset 0x1614, size 0x4
    CARPART_LOD mMinReflectionLodLevel;   // offset 0x1618, size 0x4
    CarPartCuller TheCarPartCuller;       // offset 0x161C, size 0x134
    static bool mAlphaWritesEnabled;
    DamageZone::Info mDamageZoneInfo;  // offset 0x1750, size 0x4
    float mDeltaTime;                  // offset 0x1754, size 0x4
    float mRadius;                     // offset 0x1758, size 0x4
    Attrib::Gen::ecar mAttributes;     // offset 0x175C, size 0x14
    bool mFlashing;                    // offset 0x1770, size 0x1
    float mFlashInterval;              // offset 0x1774, size 0x4
    DamageZone::Info mDamageInfoCache; // offset 0x1778, size 0x4
    bool mWheelWobbleEnabled[4];       // offset 0x177C, size 0x4
    bool mMirrorLeftWheels;            // offset 0x178C, size 0x1
};

bool AlphaWritesEnabled = true;

static const int NUM_DASHES = 3;

enum DASH_INDEX {
    DASH_F50 = 0,
    DASH_BARCHETTA = 1,
    DASH_360 = 2,
};

// TODO use these, the values are from Undercover, so they might be different in MW

DASH_INDEX dash_index;

static const float dashPositionX[3] = {-0.25581399f, -0.25581399f, -0.25128201f};

static const float dashPositionY[3] = {-0.107692f, -0.15897401f, -0.179488f};

static const float dashPositionZ[3] = {-0.308f, -0.40697601f, -0.32307601f};

static const float dashScaleX[3] = {0.89999998f, 0.89999998f, 0.89999998f};

static const float dashScaleY[3] = {1.703488f, 2.0f, 1.703488f};

static const float dashScaleZ[3] = {1.697674f, 2.0f, 1.697674f};

float WheelPivotTranslationAmount = 0.5f;

float WheelStandardWidth = 0.225f;

float WheelStandardRadius = 0.32f;

static const float TweakWheelWidthScale = 1.0f;
static const float TweakWheelRadiusScale = 1.0f;
