
#include "Chassis.h"
#include "Speed/Indep/Libs/Support/Utility/UEALibs.hpp"
#include "Speed/Indep/Libs/Support/Utility/UMath.h"
#include "Speed/Indep/Libs/Support/Utility/UTypes.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/brakes.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/chassis.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/tires.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/transmission.h"
#include "Speed/Indep/Src/Interfaces/Simables/ICollisionBody.h"
#include "Speed/Indep/Src/Interfaces/Simables/IINput.h"
#include "Speed/Indep/Src/Interfaces/Simables/INISCarControl.h"
#include "Speed/Indep/Src/Physics/Behavior.h"
#include "Speed/Indep/Src/Physics/PhysicsInfo.hpp"
#include "Speed/Indep/Src/Physics/Wheel.h"
#include "Speed/Indep/bWare/Inc/bMath.hpp"
#include <cmath>

extern float gNIS_AeroDynamics;
void OrthoInverse(UMath::Matrix4 &m);

// total size: 0x198
class SuspensionSpline : public Chassis, public INISCarControl {
  public:
    // total size: 0x124
    class Tire : public Wheel {
      public:
        Tire(float radius);
        void BeginFrame();
        void EndFrame(float dT);
        void UpdateFree(float dT);
        void UpdateLoaded(float lat_vel, float fwd_vel, float load, float dT);

        void MatchSpeed(float speed) {
            mLocked = false;
            mSlip = 0.0f;
            mRoadSpeed = speed;
            mSlipAngle = 0.0f;
            mLateralSpeed = 0.0f;
            mAV = speed / mRadius;
        }

        float GetRadius() const {
            return mRadius;
        }

        float GetAngularVelocity() const {
            return mAV;
        }

        float GetCurrentSlip() const {
            return mSlip;
        }

        float GetRoadSpeed() const {
            return mRoadSpeed;
        }

        float GetLateralSpeed() const {
            return mLateralSpeed;
        }

        float GetLoad() const {
            return mLoad;
        }

        float GetSlipAngle() const {
            return mSlipAngle;
        }

        float GetTraction() const {
            return mLocked ? 0.0f : 1.0f;
        }

        void SetAngularVelocity(float av) {
            mAV = av;
        }

        void SetLocked(bool locked) {
            mLocked = locked;
        }

        void SetBurnout(float speed) {
            mBurnout = speed;
        }

      private:
        bool mLocked;        // offset 0xC4, size 0x1
        float mBurnout;      // offset 0xC8, size 0x4
        const float mRadius; // offset 0xCC, size 0x4
        float mAV;           // offset 0xD0, size 0x4
        float mSlip;         // offset 0xD4, size 0x4
        float mRoadSpeed;    // offset 0xD8, size 0x4
        float mSlipAngle;    // offset 0xDC, size 0x4
        float mLateralSpeed; // offset 0xE0, size 0x4
        float mLoad;         // offset 0xE4, size 0x4
    };

    static Behavior *Construct(const BehaviorParams &params);

    SuspensionSpline(const struct BehaviorParams &bp, const SuspensionParams &sp);
    void DoSteering(State &state, UMath::Vector3 &right, UMath::Vector3 &left);
    void GetWheelBase(float *width, float *length);
    void DoWheelForces(State &state);
    void NISCarTweaks(float dT);

    // Overrides
    // IUnknown
    ~SuspensionSpline() override;

    // ISuspension
    float GetWheelTraction(unsigned int index) const override;
    unsigned int GetNumWheels() const override;
    const UMath::Vector3 &GetWheelPos(unsigned int i) const override;
    const UMath::Vector3 &GetWheelLocalPos(unsigned int i) const override;
    void MatchSpeed(float speed) override;
    UMath::Vector3 GetWheelCenterPos(unsigned int i) const override;
    float GetWheelLoad(unsigned int i) const override;
    void ApplyVehicleEntryForces(bool enteringVehicle, const UMath::Vector3 &pos, bool calledfromEvent) override;
    const float GetWheelRoadHeight(unsigned int i) const override;
    bool IsWheelOnGround(unsigned int i) const override;
    float GetCompression(unsigned int i) const override;
    float GetWheelSlip(unsigned int idx) const override;
    float GetToleratedSlip(unsigned int idx) const override;
    float GetWheelSkid(unsigned int idx) const override;
    float GetWheelSlipAngle(unsigned int idx) const override;
    const UMath::Vector4 &GetWheelRoadNormal(unsigned int i) const override;
    const SimSurface &GetWheelRoadSurface(unsigned int i) const override;
    const UMath::Vector3 &GetWheelVelocity(unsigned int i) const override;
    int GetNumWheelsOnGround() const override;
    Radians GetWheelAngularVelocity(int index) const override;
    void SetWheelAngularVelocity(int wheel, float w) override;
    float GetWheelSteer(unsigned int wheel) const override;
    float GetWheelRadius(unsigned int index) const override;
    float GetMaxSteering() const override;

    // Behavior
    void OnTaskSimulate(float dT) override;
    void Reset() override;
    void OnBehaviorChange(const UCrc32 &mechanic) override;

    // INISCarControl
    float GetBurnout() const override;
    void SetBurnout(float speed) override;
    void SetBrakeLock(bool front, bool rear) override;
    void SetConstraintAngle(float angle) override;
    void SetSteering(float angle, float weight) override;
    bool SetNISPosition(const UMath::Matrix4 &position, bool initial, float dT) override;
    void RestoreState() override;
    void SetAnimPitch(float dip, float time) override;
    void SetAnimRoll(float dip, float time) override;
    void SetAnimShake(float dip, float cycleRate, float cycleRamp, float time) override;
    float GetAnimPitch() const override;
    float GetAnimRoll() const override;
    float GetAnimShake() const override;

    Tire &GetWheel(unsigned int i) {
        return *mTires[i];
    }

  private:
    BehaviorSpecsPtr<Attrib::Gen::tires> mTireInfo;              // offset 0x9C, size 0x14
    BehaviorSpecsPtr<Attrib::Gen::chassis> mSuspensionInfo;      // offset 0xB0, size 0x14
    BehaviorSpecsPtr<Attrib::Gen::transmission> mDrivetrainInfo; // offset 0xC4, size 0x14
    IRigidBody *mRB;                                             // offset 0xD8, size 0x4
    ICollisionBody *mCollisionBody;                              // offset 0xDC, size 0x4
    IInput *mInput;                                              // offset 0xE0, size 0x4
    IEngine *mIEngine;                                           // offset 0xE4, size 0x4
    unsigned int mNumWheelsOnGround;                             // offset 0xE8, size 0x4
    const float mMaxSteering;                                    // offset 0xEC, size 0x4
    float mSteering;                                             // offset 0xF0, size 0x4
    float mNISSteering;                                          // offset 0xF4, size 0x4
    float mNISSteeringWeight;                                    // offset 0xF8, size 0x4
    float mTimeInAir;                                            // offset 0xFC, size 0x4
    float mBurnout;                                              // offset 0x100, size 0x4
    bool mBrakeLockFront;                                        // offset 0x104, size 0x1
    bool mBrakeLockRear;                                         // offset 0x108, size 0x1
    float mConstraint;                                           // offset 0x10C, size 0x4
    UMath::Matrix4 mNISPosition;                                 // offset 0x110, size 0x40
    float mAnimatedPitchLength;                                  // offset 0x150, size 0x4
    float mAnimatedPitch;                                        // offset 0x154, size 0x4
    float mAnimatedPitchDelta;                                   // offset 0x158, size 0x4
    float mAnimatedPitchTime;                                    // offset 0x15C, size 0x4
    float mAnimatedRollLength;                                   // offset 0x160, size 0x4
    float mAnimatedRoll;                                         // offset 0x164, size 0x4
    float mAnimatedRollDelta;                                    // offset 0x168, size 0x4
    float mAnimatedRollTime;                                     // offset 0x16C, size 0x4
    float mAnimatedShakeLength;                                  // offset 0x170, size 0x4
    float mAnimatedShakeCycleRate;                               // offset 0x174, size 0x4
    float mAnimatedShakeRamp;                                    // offset 0x178, size 0x4
    float mAnimatedShake;                                        // offset 0x17C, size 0x4
    float mAnimatedShakeDelta;                                   // offset 0x180, size 0x4
    float mAnimatedShakeTime;                                    // offset 0x184, size 0x4
    Tire *mTires[4];                                             // offset 0x188, size 0x10
};

SuspensionSpline::Tire::Tire(float radius)
    : Wheel(0),                          //
      mLocked(false),                    //
      mBurnout(0.0f),                    //
      mRadius(UMath::Max(radius, 0.1f)), //
      mAV(0.0f),                         //
      mSlip(0.0f),                       //
      mRoadSpeed(0.0f),                  //
      mSlipAngle(0.0f),                  //
      mLateralSpeed(0.0f),               //
      mLoad(0.0f) {}

void SuspensionSpline::Tire::BeginFrame() {
    SetForce(UMath::Vector3::kZero);
    mLoad = 0.0f;
}

void SuspensionSpline::Tire::EndFrame(float dT) {}

void SuspensionSpline::Tire::UpdateFree(float dT) {
    mSlip = 0.0f;
    mSlipAngle = 0.0f;
    if (mLocked) {
        mAV = 0.0f;
    }
}

Behavior *SuspensionSpline::Construct(const BehaviorParams &params) {
    // "BASE"
