
#include "Chassis.h"
#include "Speed/Indep/Libs/Support/Utility/UMath.h"
#include "Speed/Indep/Libs/Support/Utility/UTypes.h"
#include "Speed/Indep/Src/Debug/Debugable.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/brakes.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/chassis.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/tires.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/transmission.h"
#include "Speed/Indep/Src/Generated/Hash.hpp"
#include "Speed/Indep/Src/Interfaces/IAttributeable.h"
#include "Speed/Indep/Src/Interfaces/IListener.h"
#include "Speed/Indep/Src/Interfaces/Simables/ICheater.h"
#include "Speed/Indep/Src/Interfaces/Simables/ICollisionBody.h"
#include "Speed/Indep/Src/Interfaces/Simables/IINput.h"
#include "Speed/Indep/Src/Interfaces/Simables/IVehicle.h"
#include "Speed/Indep/Src/Physics/Behavior.h"
#include "Speed/Indep/Src/Physics/Common/VehicleSystem.h"
#include "Speed/Indep/Src/Physics/PhysicsInfo.hpp"
#include "Speed/Indep/Src/Physics/Wheel.h"
#include "Speed/Indep/Src/Sim/Collision.h"
#include "Speed/Indep/Tools/Inc/ConversionUtil.hpp"

// total size: 0x144
class SuspensionSimple : public Chassis, public Sim::Collision::IListener, public IAttributeable, public Debugable {
  public:
    // total size: 0x124
    class Tire : public Wheel {
      public:
        enum LastRotationSign {
            WAS_POSITIVE = 0,
            WAS_ZERO = 1,
            WAS_NEGATIVE = 2,
        };

        Tire(float radius, int index, const Attrib::Gen::tires *specs, const Attrib::Gen::brakes *brakes);

        void SetBrake(float brake) {
            this->mBrake = brake;
        }
        void SetEBrake(float ebrake) {
            this->mEBrake = ebrake;
        }
        float GetEBrake() const {
            return this->mEBrake;
        }

        float GetTraction() const {
            return this->mTraction;
        }
        float GetRadius() const {
            return this->mRadius;
        }
        Radians GetAngularVelocity() const {
            return this->mAV;
        }
        Radians GetAngularAcceleration() const {
            return this->mAngularAcc;
        }
        void SetAngularVelocity(Radians w) {
            this->mAV = w;
        }
        Newtons GetLoad() const {
            return this->mLoad;
        }

        Mps GetToleratedSlip() const {
            return this->mMaxSlip;
        }
        Mps GetCurrentSlip() const {
            return this->mSlip;
        }

        void SetTractionBoost(float boost) {
            this->mTractionBoost = boost;
        }
        void ScaleTractionBoost(float scale) {
            this->mTractionBoost *= scale;
        }

        void Stop() {
            this->mAV = 0.0f;
            this->mSlip = 0.0f;
            this->mRoadSpeed = 0.0f;
            this->mSlipAngle = 0.0f;
        }

        void BeginFrame(float max_slip, float grip_scale, float traction_boost);
        void EndFrame(float dT);

        void AllowSlip(bool b) {
            this->mAllowSlip = b;
        }

        void ApplyTorque(float torque) {
            if (!this->mBrakeLocked) {
                this->mAppliedTorque += torque;
            }
        }

        float GetLateralForce() const {
            return this->mLateralForce;
        }
        float GetLongitudeForce() const {
            return this->mLongitudeForce;
        }
        float GetLateralSpeed() const {
            return this->mLateralSpeed;
        }

        bool IsSteeringWheel() const {
            return this->mWheelIndex < 2; // TODO correct?
        }

        float UpdateLoaded(float lat_vel, float fwd_vel, float body_speed, float load, float dT, float drag_reduction);
        void UpdateFree(float dT);

        Nm GetTorque() const {
            return this->mLastTorque;
        }

        void Reset() {
            Wheel::Reset();
            this->mLoad = 0.0f;
            this->mBrake = 0.0f;
            this->mEBrake = 0.0f;
            this->mAV = 0.0f;
            this->mLateralForce = 0.0f;
            this->mLongitudeForce = 0.0f;
            this->mAppliedTorque = 0.0f;
            this->mTractionBoost = 1.0f;
            this->mSlip = 0.0f;
            this->mLateralSpeed = 0.0f;
            this->mRoadSpeed = 0.0f;
            this->mTraction = 1.0f;
            this->mBrakeLocked = false;
            this->mAllowSlip = false;
            this->mLastTorque = 0.0f;
            this->mAngularAcc = 0.0f;
            this->mMaxSlip = 0.5f;
        }

        void MatchSpeed(Mps speed) {
            this->mAV = speed / mRadius;
            this->mRoadSpeed = speed;
            this->mTraction = 1.0f;
            this->mBrakeLocked = false;
            this->mSlip = 0.0f;
            this->mAngularAcc = 0.0f;
            this->mLastTorque = 0.0f;
            this->mBrake = 0.0f;
            this->mEBrake = 0.0f;
        }

        Angle GetSlipAngle() const {
            return mSlipAngle;
        }

      private:
        const float mRadius;                // offset 0xC4, size 0x4
        float mBrake;                       // offset 0xC8, size 0x4
        float mEBrake;                      // offset 0xCC, size 0x4
        float mAV;                          // offset 0xD0, size 0x4
        float mLoad;                        // offset 0xD4, size 0x4
        float mLateralForce;                // offset 0xD8, size 0x4
        float mLongitudeForce;              // offset 0xDC, size 0x4
        float mAppliedTorque;               // offset 0xE0, size 0x4
        float mTractionBoost;               // offset 0xE4, size 0x4
        float mSlip;                        // offset 0xE8, size 0x4
        float mLateralSpeed;                // offset 0xEC, size 0x4
        const int mWheelIndex;              // offset 0xF0, size 0x4
        float mRoadSpeed;                   // offset 0xF4, size 0x4
        const Attrib::Gen::tires *mSpecs;   // offset 0xF8, size 0x4
        const Attrib::Gen::brakes *mBrakes; // offset 0xFC, size 0x4
        Angle mSlipAngle;                   // offset 0x100, size 0x4
        const int mAxleIndex;               // offset 0x104, size 0x4
        float mTraction;                    // offset 0x108, size 0x4
        bool mBrakeLocked;                  // offset 0x10C, size 0x1
        bool mAllowSlip;                    // offset 0x110, size 0x1
        Nm mLastTorque;                     // offset 0x114, size 0x4
        Radians mAngularAcc;                // offset 0x118, size 0x4
        float mMaxSlip;                     // offset 0x11C, size 0x4
        float mGripBoost;                   // offset 0x120, size 0x4
    };

    SuspensionSimple(const struct BehaviorParams &bp, const SuspensionParams &sp);
    static Behavior *Construct(const BehaviorParams &params);
    ~SuspensionSimple() override;

    // IAttributeable
    void OnAttributeChange(const Attrib::Collection *aspec, Attrib::Key attribkey) override;

    void OnDebugDraw();

    // ISuspension
    void MatchSpeed(float speed) override;
    float GetWheelTraction(unsigned int index) const override {
        return mTires[index]->GetTraction();
    }
    float GetWheelAngularVelocity(int index) const override {
        return mTires[index]->GetAngularVelocity();
    }
    float GetWheelRadius(unsigned int index) const override {
        return mTires[index]->GetRadius();
    }
    float GetWheelSlip(unsigned int idx) const override {
        return mTires[idx]->GetCurrentSlip();
    }
    Mps GetToleratedSlip(unsigned int idx) const override {
        return mTires[idx]->GetToleratedSlip();
    }
    Newtons GetWheelLoad(unsigned int i) const override {
        return mTires[i]->GetLoad();
    }
    float GetWheelSkid(unsigned int idx) const override {
        return mTires[idx]->GetLateralSpeed();
    }
    void SetWheelAngularVelocity(int wheel, float w) override {
        mTires[wheel]->SetAngularVelocity(w);
    }
    unsigned int GetNumWheels() const override {
        return 4;
    }
    const UMath::Vector3 &GetWheelPos(unsigned int i) const override {
        return mTires[i]->GetPosition();
    }
    const UMath::Vector3 &GetWheelLocalPos(unsigned int i) const override {
        return mTires[i]->GetLocalArm();
    }
    UMath::Vector3 GetWheelCenterPos(unsigned int i) const override;
    void ApplyVehicleEntryForces(bool enteringVehicle, const UMath::Vector3 &pos, bool calledfromEvent) override {}
    const float GetWheelRoadHeight(unsigned int i) const override {
        return mTires[i]->GetNormal().w;
    }
    float GetCompression(unsigned int i) const override {
        return mTires[i]->GetCompression();
    }
    const UMath::Vector4 &GetWheelRoadNormal(unsigned int i) const override {
        return mTires[i]->GetNormal();
    }
    bool IsWheelOnGround(unsigned int i) const override {
        return mTires[i]->IsOnGround();
    }
    const SimSurface &GetWheelRoadSurface(unsigned int i) const override {
        return mTires[i]->GetSurface();
    }
    const UMath::Vector3 &GetWheelVelocity(unsigned int i) const override {
        return mTires[i]->GetVelocity();
    }
    int GetNumWheelsOnGround() const override {
        return mNumWheelsOnGround;
    }
    float GetWheelSteer(unsigned int wheel) const override {
        if (wheel < 2) {
            return RAD2ANGLE(mWheelSteer[wheel]);
        }
        return 0.0f;
    }
    float GetMaxSteering() const override {
        return DEG2ANGLE(mMaxSteering);
    }
    Angle GetWheelSlipAngle(unsigned int idx) const override {
        return mTires[idx]->GetSlipAngle();
    }

    // IListener
    void OnCollision(const COLLISION_INFO &cinfo) override;

    // Behavior
    void OnTaskSimulate(float dT) override;
    void Reset() override;

  protected:
    void DoWheelForces(struct State &state);
    void DoDriveForces(State &state);
    void DoSteering(State &state, UMath::Vector3 &right, UMath::Vector3 &left);
    void DoWallSteer(State &state);
    void DoAerobatics(State &state);

    // Behavior
    void OnBehaviorChange(const UCrc32 &mechanic) override;

    Tire &GetWheel(unsigned int i) {
        return *mTires[i];
    }

    const Tire &GetWheel(unsigned int i) const {
        return *mTires[i];
    }

  private:
    void CreateTires();

    BehaviorSpecsPtr<Attrib::Gen::brakes> mBrakeInfo;            // offset 0xA0, size 0x14
    BehaviorSpecsPtr<Attrib::Gen::tires> mTireInfo;              // offset 0xB4, size 0x14
    BehaviorSpecsPtr<Attrib::Gen::chassis> mSuspensionInfo;      // offset 0xC8, size 0x14
    BehaviorSpecsPtr<Attrib::Gen::transmission> mDrivetrainInfo; // offset 0xDC, size 0x14
    IRigidBody *mRB;                                             // offset 0xF0, size 0x4
    ICollisionBody *mRBComplex;                                  // offset 0xF4, size 0x4
    IInput *mInput;                                              // offset 0xF8, size 0x4
    ITransmission *mTrany;                                       // offset 0xFC, size 0x4
    ICheater *mCheater;                                          // offset 0x100, size 0x4
    float mFrictionBoost;                                        // offset 0x104, size 0x4
    float mDraft;                                                // offset 0x108, size 0x4
    bool mPowerSliding;                                          // offset 0x10C, size 0x1
    float mWheelSteer[2];                                        // offset 0x110, size 0x8
    float mYawControlMultiplier;                                 // offset 0x118, size 0x4
    unsigned int mNumWheelsOnGround;                             // offset 0x11C, size 0x4
    float mAgainstWall;                                          // offset 0x120, size 0x4
    Degrees mMaxSteering;                                        // offset 0x124, size 0x4
    float mTimeInAir;                                            // offset 0x128, size 0x4
    float mSleepTime;                                            // offset 0x12C, size 0x4
    bool mDriftPhysics;                                          // offset 0x130, size 0x1
    Tire *mTires[4];                                             // offset 0x134, size 0x10
};

SuspensionSimple::Tire::Tire(float radius, int index, const Attrib::Gen::tires *specs, const Attrib::Gen::brakes *brakes)
    : Wheel(1),                          //
      mRadius(UMath::Max(radius, 0.1f)), //
      mBrake(0.0f),                      //
      mEBrake(0.0f),                     //
      mAV(0.0f),                         //
      mLoad(0.0f),                       //
      mLateralForce(0.0f),               //
      mLongitudeForce(0.0f),             //
      mAppliedTorque(0.0f),              //
      mTractionBoost(1.0f),              //
      mSlip(0.0f),                       //
      mLateralSpeed(0.0f),               //
      mWheelIndex(index),                //
      mRoadSpeed(0.0f),                  //
      mSpecs(specs),                     //
      mBrakes(brakes),                   //
      mSlipAngle(0.0f),                  //
