
#include "Chassis.h"
#include "Speed/Indep/Libs/Support/Utility/UMath.h"
#include "Speed/Indep/Libs/Support/Utility/UTypes.h"
#include "Speed/Indep/Src/Debug/Debugable.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/brakes.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/chassis.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/tires.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/transmission.h"
#include "Speed/Indep/Src/Interfaces/IAttributeable.h"
#include "Speed/Indep/Src/Interfaces/IListener.h"
#include "Speed/Indep/Src/Interfaces/Simables/ICheater.h"
#include "Speed/Indep/Src/Interfaces/Simables/ICollisionBody.h"
#include "Speed/Indep/Src/Interfaces/Simables/IINput.h"
#include "Speed/Indep/Src/Physics/Behavior.h"
#include "Speed/Indep/Src/Physics/PhysicsInfo.hpp"
#include "Speed/Indep/Src/Physics/Wheel.h"
#include "Speed/Indep/Src/Sim/Collision.h"
#include "Speed/Indep/Tools/Inc/ConversionUtil.hpp"

// total size: 0x144
class SuspensionSimple : public Chassis, public Sim::Collision::IListener, public IAttributeable, public Debugable {
  public:
    // total size: 0x124
    class Tire : public Wheel {
      public:
        enum LastRotationSign {
            WAS_POSITIVE = 0,
            WAS_ZERO = 1,
            WAS_NEGATIVE = 2,
        };

        Tire(float radius, int index, const Attrib::Gen::tires *specs, const Attrib::Gen::brakes *brakes);
        void BeginFrame(float max_slip, float grip_scale, float traction_boost);
        void EndFrame(float dT);
        void UpdateFree(float dT);
        float UpdateLoaded(float lat_vel, float fwd_vel, float body_speed, float load, float dT, float drag_reduction);

        void MatchSpeed(float speed) {
            mAV = speed / mRadius;
            mRoadSpeed = speed;
            mTraction = 1.0f;
            mBrakeLocked = false;
            mSlip = 0.0f;
            mAngularAcc = 0.0f;
            mLastTorque = 0.0f;
            mBrake = 0.0f;
            mEBrake = 0.0f;
        }

        void Reset() {
            Wheel::Reset();
            mLoad = 0.0f;
            mBrake = 0.0f;
            mEBrake = 0.0f;
            mAV = 0.0f;
            mLateralForce = 0.0f;
            mLongitudeForce = 0.0f;
            mAppliedTorque = 0.0f;
            mTractionBoost = 1.0f;
            mSlip = 0.0f;
            mLateralSpeed = 0.0f;
            mRoadSpeed = 0.0f;
            mTraction = 1.0f;
            mBrakeLocked = false;
            mAllowSlip = false;
            mLastTorque = 0.0f;
            mAngularAcc = 0.0f;
            mMaxSlip = 0.5f;
        }

        float GetRadius() const {
            return mRadius;
        }

        void SetBrake(float brake) {
            mBrake = brake;
        }

        void SetEBrake(float ebrake) {
            mEBrake = ebrake;
        }

        float GetAngularVelocity() const {
            return mAV;
        }

        float GetLoad() const {
            return mLoad;
        }

        float GetTraction() const {
            return mTraction;
        }

        float GetSlip() const {
            return mSlip;
        }

        float GetLateralSpeed() const {
            return mLateralSpeed;
        }

        float GetSlipAngle() const {
            return mSlipAngle;
        }

        float GetToleratedSlip() const {
            return mMaxSlip;
        }

        void SetAngularVelocity(float av) {
            mAV = av;
        }

        float GetLongitudeForce() const {
            return mLongitudeForce;
        }

        void ApplyTorque(float torque) {
            if (!mBrakeLocked) {
                mAppliedTorque += torque;
            }
        }

        void ScaleTractionBoost(float scale) {
            mTractionBoost *= scale;
        }

        void SetTractionBoost(float boost) {
            mTractionBoost = boost;
        }

        void AllowSlip(bool b) {
            mAllowSlip = b;
        }

        void Stop() {
            mAV = 0.0f;
            mSlip = 0.0f;
            mRoadSpeed = 0.0f;
            mSlipAngle = 0.0f;
        }

      private:
        const float mRadius;                // offset 0xC4, size 0x4
        float mBrake;                       // offset 0xC8, size 0x4
        float mEBrake;                      // offset 0xCC, size 0x4
        float mAV;                          // offset 0xD0, size 0x4
        float mLoad;                        // offset 0xD4, size 0x4
        float mLateralForce;                // offset 0xD8, size 0x4
        float mLongitudeForce;              // offset 0xDC, size 0x4
        float mAppliedTorque;               // offset 0xE0, size 0x4
        float mTractionBoost;               // offset 0xE4, size 0x4
        float mSlip;                        // offset 0xE8, size 0x4
        float mLateralSpeed;                // offset 0xEC, size 0x4
        const int mWheelIndex;              // offset 0xF0, size 0x4
        float mRoadSpeed;                   // offset 0xF4, size 0x4
        const Attrib::Gen::tires *mSpecs;   // offset 0xF8, size 0x4
        const Attrib::Gen::brakes *mBrakes; // offset 0xFC, size 0x4
        float mSlipAngle;                   // offset 0x100, size 0x4
        const int mAxleIndex;               // offset 0x104, size 0x4
        float mTraction;                    // offset 0x108, size 0x4
        bool mBrakeLocked;                  // offset 0x10C, size 0x1
        bool mAllowSlip;                    // offset 0x110, size 0x1
        float mLastTorque;                  // offset 0x114, size 0x4
        float mAngularAcc;                  // offset 0x118, size 0x4
        float mMaxSlip;                     // offset 0x11C, size 0x4
        float mGripBoost;                   // offset 0x120, size 0x4
    };

    static Behavior *Construct(const BehaviorParams &params);

    SuspensionSimple(const struct BehaviorParams &bp, const SuspensionParams &sp);
    void CreateTires();
    void DoAerobatics(State &state);
    void DoSteering(State &state, UMath::Vector3 &right, UMath::Vector3 &left);
    void DoWallSteer(State &state);
    void DoDriveForces(State &state);
    void DoWheelForces(State &state);

    // Overrides
    // IUnknown
    ~SuspensionSimple() override;

    // IAttributeable
    void OnAttributeChange(const Attrib::Collection *aspec, unsigned int attribkey) override;

    // ISuspension
    float GetWheelTraction(unsigned int index) const override {
        return mTires[index]->GetTraction();
    }
    unsigned int GetNumWheels() const override {
        return 4;
    }
    const UMath::Vector3 &GetWheelPos(unsigned int i) const override {
        return mTires[i]->GetPosition();
    }
    const UMath::Vector3 &GetWheelLocalPos(unsigned int i) const override {
        return mTires[i]->GetLocalArm();
    }
    UMath::Vector3 GetWheelCenterPos(unsigned int i) const override;
    float GetWheelLoad(unsigned int i) const override {
        return mTires[i]->GetLoad();
    }
    void ApplyVehicleEntryForces(bool enteringVehicle, const UMath::Vector3 &pos, bool calledfromEvent) override {}
    const float GetWheelRoadHeight(unsigned int i) const override {
        return mTires[i]->GetNormal().w;
    }
    bool IsWheelOnGround(unsigned int i) const override {
        return mTires[i]->IsOnGround();
    }
    float GetCompression(unsigned int i) const override {
        return mTires[i]->GetCompression();
    }
    float GetWheelSlip(unsigned int idx) const override {
        return mTires[idx]->GetSlip();
    }
    float GetToleratedSlip(unsigned int idx) const override {
        return mTires[idx]->GetToleratedSlip();
    }
    float GetWheelSkid(unsigned int idx) const override {
        return mTires[idx]->GetLateralSpeed();
    }
    float GetWheelSlipAngle(unsigned int idx) const override {
        return mTires[idx]->GetSlipAngle();
    }
    const UMath::Vector4 &GetWheelRoadNormal(unsigned int i) const override {
        return mTires[i]->GetNormal();
    }
    const SimSurface &GetWheelRoadSurface(unsigned int i) const override {
        return mTires[i]->GetSurface();
    }
    const UMath::Vector3 &GetWheelVelocity(unsigned int i) const override {
        return mTires[i]->GetVelocity();
    }
    int GetNumWheelsOnGround() const override {
        return mNumWheelsOnGround;
    }
    Radians GetWheelAngularVelocity(int index) const override {
        return mTires[index]->GetAngularVelocity();
    }
    void SetWheelAngularVelocity(int wheel, float w) override {
        mTires[wheel]->SetAngularVelocity(w);
    }
    float GetWheelSteer(unsigned int wheel) const override {
        if (wheel < 2) {
            return RAD2ANGLE(mWheelSteer[wheel]);
        }
        return 0.0f;
    }
    float GetWheelRadius(unsigned int index) const override {
        return mTires[index]->GetRadius();
    }
    float GetMaxSteering() const override {
        return DEG2ANGLE(mMaxSteering);
    }
    void MatchSpeed(float speed) override;

    // Behavior
    void OnBehaviorChange(const UCrc32 &mechanic) override;
    void OnTaskSimulate(float dT) override;
    void Reset() override;

    // IListener
    virtual void OnCollision(const COLLISION_INFO &cinfo);

    Tire &GetWheel(unsigned int i) {
        return *mTires[i];
    }

  private:
    BehaviorSpecsPtr<Attrib::Gen::brakes> mBrakeInfo;            // offset 0xA0, size 0x14
    BehaviorSpecsPtr<Attrib::Gen::tires> mTireInfo;              // offset 0xB4, size 0x14
    BehaviorSpecsPtr<Attrib::Gen::chassis> mSuspensionInfo;      // offset 0xC8, size 0x14
    BehaviorSpecsPtr<Attrib::Gen::transmission> mDrivetrainInfo; // offset 0xDC, size 0x14
    IRigidBody *mRB;                                             // offset 0xF0, size 0x4
    ICollisionBody *mRBComplex;                                  // offset 0xF4, size 0x4
    IInput *mInput;                                              // offset 0xF8, size 0x4
    ITransmission *mTrany;                                       // offset 0xFC, size 0x4
    ICheater *mCheater;                                          // offset 0x100, size 0x4
    float mFrictionBoost;                                        // offset 0x104, size 0x4
    float mDraft;                                                // offset 0x108, size 0x4
    bool mPowerSliding;                                          // offset 0x10C, size 0x1
    float mWheelSteer[2];                                        // offset 0x110, size 0x8
    float mYawControlMultiplier;                                 // offset 0x118, size 0x4
    unsigned int mNumWheelsOnGround;                             // offset 0x11C, size 0x4
    float mAgainstWall;                                          // offset 0x120, size 0x4
    float mMaxSteering;                                          // offset 0x124, size 0x4
    float mTimeInAir;                                            // offset 0x128, size 0x4
    float mSleepTime;                                            // offset 0x12C, size 0x4
    bool mDriftPhysics;                                          // offset 0x130, size 0x1
    Tire *mTires[4];                                             // offset 0x134, size 0x10
};

SuspensionSimple::Tire::Tire(float radius, int index, const Attrib::Gen::tires *specs, const Attrib::Gen::brakes *brakes)
    : Wheel(1), //
      mRadius(UMath::Max(radius, 0.1f)), //
      mBrake(0.0f), //
      mEBrake(0.0f), //
      mAV(0.0f), //
      mLoad(0.0f), //
      mLateralForce(0.0f), //
      mLongitudeForce(0.0f), //
      mAppliedTorque(0.0f), //
      mTractionBoost(1.0f), //
      mSlip(0.0f), //
      mLateralSpeed(0.0f), //
      mWheelIndex(index), //
      mRoadSpeed(0.0f), //
      mSpecs(specs), //
      mBrakes(brakes), //
      mSlipAngle(0.0f), //
      mAxleIndex(index >> 1), //
      mBrakeLocked(false), //
      mAllowSlip(false), //
      mLastTorque(0.0f), //
      mAngularAcc(0.0f), //
      mMaxSlip(0.5f), //
      mGripBoost(1.0f) {}

void SuspensionSimple::Tire::BeginFrame(float max_slip, float grip_scale, float traction_boost) {
