#include "Speed/Indep/Libs/Support/Utility/UMath.h"
#include "Speed/Indep/Libs/Support/Utility/UVector.h"
#include "Speed/Indep/Src/Debug/Debugable.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/brakes.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/chassis.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/tires.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/transmission.h"
#include "Speed/Indep/Src/Input/ISteeringWheel.h"
#include "Speed/Indep/Src/Interfaces/IAttributeable.h"
#include "Speed/Indep/Src/Interfaces/IListener.h"
#include "Speed/Indep/Src/Interfaces/SimEntities/IPlayer.h"
#include "Speed/Indep/Src/Interfaces/Simables/IAI.h"
#include "Speed/Indep/Src/Interfaces/Simables/IRigidBody.h"
#include "Speed/Indep/Src/Interfaces/Simables/ISimable.h"
#include "Speed/Indep/Src/Interfaces/Simables/ISuspension.h"
#include "Speed/Indep/Src/Interfaces/Simables/IVehicle.h"
#include "Speed/Indep/Src/Misc/Table.hpp"
#include "Speed/Indep/Src/Physics/Behaviors/Chassis.h"
#include "Speed/Indep/Src/Physics/Common/VehicleSystem.h"
#include "Speed/Indep/Src/Physics/PhysicsInfo.hpp"
#include "Speed/Indep/Src/Physics/PhysicsTunings.h"
#include "Speed/Indep/Src/Physics/Wheel.h"
#include "Speed/Indep/Src/Sim/Simulation.h"
#include "Speed/Indep/Tools/Inc/ConversionUtil.hpp"

// Credits: Brawltendo
class SuspensionRacer : public Chassis, public Sim::Collision::IListener, public IAttributeable, Debugable {
  public:
    class Tire : public Wheel {
      public:
        Tire(float radius, int index, const Attrib::Gen::tires *specs, const Attrib::Gen::brakes *brakes);
        void BeginFrame(float max_slip, float grip_boost, float traction_boost, float drag_reduction);
        void EndFrame(float dT);
        float ComputeLateralForce(float load, float slip_angle);
        float GetPilotFactor(const float speed);
        void CheckForBrakeLock(float ground_force);
        void CheckSign();
        void UpdateFree(float dT);
        float UpdateLoaded(float lat_vel, float fwd_vel, float body_speed, float load, float dT);

        bool IsOnGround() const {
            return mCompression > 0.0f;
        }

        bool IsSlipping() const {
            return mTraction >= 1.0f;
        }

        float SetBrake(float brake) {
            mBrake = brake;
        }

        float SetEBrake(float ebrake) {
            mEBrake = ebrake;
        }

        float GetEBrake() const {
            return mEBrake;
        }

        float GetTraction() const {
            return mTraction;
        }

        float GetRoadSpeed() const {
            return mRoadSpeed;
        }

        float GetLoad() const {
            return mLoad;
        }

        float GetRadius() const {
            return mRadius;
        }

        float GetAngularVelocity() const {
            return mAV;
        }

        void SetAngularVelocity(float w) {
            mAV = w;
        }

        float GetLateralSpeed() const {
            return mLateralSpeed;
        }

        float GetCurrentSlip() const {
            return mSlip;
        }

        float GetToleratedSlip() const {
            return mMaxSlip;
        }

        void SetLateralBoost(float f) {
            mLateralBoost = f;
        }

        void SetBottomOutTime(float time) {
            mBottomOutTime = time;
        }

        void ScaleTractionBoost(float scale) {
            mTractionBoost *= scale;
        }

        void SetDriftFriction(float scale) {
            mDriftFriction = scale;
        }

        void ApplyDriveTorque(float torque) {
            if (!mBrakeLocked) {
                mDriveTorque += torque;
            }
        }

        void ApplyBrakeTorque(float torque) {
            if (!mBrakeLocked) {
                mBrakeTorque += torque;
            }
        }

        float GetTotalTorque() const {
            return mDriveTorque + mBrakeTorque;
        }

        float GetDriveTorque() const {
            return mDriveTorque;
        }

        float GetLongitudeForce() const {
            return mLongitudeForce;
        }

        bool IsBrakeLocked() const {
            return mBrakeLocked;
        }

        bool IsSteeringWheel() const {
            return mWheelIndex < 2;
        }

        void SetTractionCircle(const UMath::Vector2 &circle) {
            mTractionCircle = circle;
        }

        float GetSlipAngle() const {
            return mSlipAngle;
        }

        void MatchSpeed(float speed) {
            mAV = speed / mRadius;
            mRoadSpeed = speed;
            mTraction = 1.0f;
            mBrakeLocked = false;
            mSlip = 0.0f;
            mAngularAcc = 0.0f;
            mLastTorque = 0.0f;
            mBrake = 0.0f;
            mEBrake = 0.0f;
            mLateralSpeed = 0.0f;
        }

      private:
        // total size: 0x140
        const float mRadius;                // offset 0xC4, size 0x4
        float mBrake;                       // offset 0xC8, size 0x4
        float mEBrake;                      // offset 0xCC, size 0x4
        float mAV;                          // offset 0xD0, size 0x4
        float mLoad;                        // offset 0xD4, size 0x4
        float mLateralForce;                // offset 0xD8, size 0x4
        float mLongitudeForce;              // offset 0xDC, size 0x4
        float mDriveTorque;                 // offset 0xE0, size 0x4
        float mBrakeTorque;                 // offset 0xE4, size 0x4
        float mLateralBoost;                // offset 0xE8, size 0x4
        float mTractionBoost;               // offset 0xEC, size 0x4
        float mSlip;                        // offset 0xF0, size 0x4
        float mLastTorque;                  // offset 0xF4, size 0x4
        const int mWheelIndex;              // offset 0xF8, size 0x4
        float mRoadSpeed;                   // offset 0xFC, size 0x4
        const Attrib::Gen::tires *mSpecs;   // offset 0x100, size 0x4
        const Attrib::Gen::brakes *mBrakes; // offset 0x104, size 0x4
        float mAngularAcc;                  // offset 0x108, size 0x4
        const int mAxleIndex;               // offset 0x10C, size 0x4
        float mTraction;                    // offset 0x110, size 0x4
        float mBottomOutTime;               // offset 0x114, size 0x4
        float mSlipAngle;                   // offset 0x118, size 0x4
        UMath::Vector2 mTractionCircle;     // offset 0x11C, size 0x8
        float mMaxSlip;                     // offset 0x124, size 0x4
        float mGripBoost;                   // offset 0x128, size 0x4
        float mDriftFriction;               // offset 0x12C, size 0x4
        float mLateralSpeed;                // offset 0x130, size 0x4
        bool mBrakeLocked;                  // offset 0x134, size 0x4

        enum LastRotationSign { WAS_POSITIVE, WAS_ZERO, WAS_NEGATIVE } mLastSign; // offset 0x138, size 0x4

        float mDragReduction; // offset 0x13C, size 0x4
    };

    // Static functions
    static Behavior *Construct(const BehaviorParams &params);

    // Methods
    SuspensionRacer(const BehaviorParams &bp, const SuspensionParams &sp);
    void CreateTires();
    void OnTaskSimulate(float dT);
    void DoDrifting(const Chassis::State &state);
    void TuneWheelParams(Chassis::State &state);
    void DoWheelForces(Chassis::State &state);
    float CalculateMaxSteering(Chassis::State &state, ISteeringWheel::SteeringType steer_type);
    float CalculateSteeringSpeed(Chassis::State &state);
    void DoWallSteer(Chassis::State &state);
    void DoDriveForces(Chassis::State &state);
    float DoHumanSteering(Chassis::State &state);
    float DoAISteering(Chassis::State &state);
    void DoSteering(Chassis::State &state, UMath::Vector3 &right, UMath::Vector3 &left);
    void DoAerobatics(Chassis::State &state);
    float CalcYawControlLimit(float speed) const;

    // Overrides
    ~SuspensionRacer() override;
    void OnCollision(const COLLISION_INFO &cinfo) override;
    void OnBehaviorChange(const UCrc32 &mechanic) override;
    void OnAttributeChange(const Attrib::Collection *aspec, unsigned int attribkey) override;
    Meters GetRideHeight(unsigned int idx) const override;
    Radians GetWheelAngularVelocity(int index) const override;
    void MatchSpeed(float speed) override;
    UMath::Vector3 GetWheelCenterPos(unsigned int i) const override;
    void Reset() override;
    void OnDebugDraw() override;

    override float GetWheelTraction(unsigned int index) const {
        return mTires[index]->GetTraction();
    }
    override float GetWheelRadius(unsigned int index) const {
        return mTires[index]->GetRadius();
    }
    override float GetWheelSlip(unsigned int idx) const {
        return mTires[idx]->GetCurrentSlip();
    }
    override float GetToleratedSlip(unsigned int idx) const {
        return mTires[idx]->GetToleratedSlip();
    }
    override float GetWheelSkid(unsigned int idx) const {
        return mTires[idx]->GetLateralSpeed();
    }
    override float GetWheelLoad(unsigned int i) const {
        return mTires[i]->GetLoad();
    }
    override void SetWheelAngularVelocity(int wheel, float w) {
        mTires[wheel]->SetAngularVelocity(w);
    }
    override unsigned int GetNumWheels() const {
        return 4;
    }
    override const UMath::Vector3 &GetWheelPos(unsigned int i) const {
        return mTires[i]->GetPosition();
    }
    override const UMath::Vector3 &GetWheelLocalPos(unsigned int i) const {
        return mTires[i]->GetLocalArm();
    }
    override void ApplyVehicleEntryForces(bool enteringVehicle, const UMath::Vector3 &pos, bool calledfromEvent) {}
    override const float GetWheelRoadHeight(unsigned int i) const {
        return mTires[i]->GetNormal().w;
    }
    override float GetCompression(unsigned int i) const {
        return mTires[i]->GetCompression();
    }
    override const UMath::Vector4 &GetWheelRoadNormal(unsigned int i) const {
        return mTires[i]->GetNormal();
    }
    override bool IsWheelOnGround(unsigned int i) const {
        return mTires[i]->IsOnGround();
    }
    override const SimSurface &GetWheelRoadSurface(unsigned int i) const {
        return mTires[i]->GetSurface();
    }
    override const UMath::Vector3 &GetWheelVelocity(unsigned int i) const {
        return mTires[i]->GetVelocity();
    }
    override int GetNumWheelsOnGround() const {
        return mNumWheelsOnGround;
    }
    override float GetWheelSteer(unsigned int wheel) const {
        return wheel < 2 ? RAD2ANGLE(mSteering.Wheels[wheel]) : 0.0f;
    }
    override float GetMaxSteering() const {
        return DEG2ANGLE(mSteering.Maximum);
    }
    override float GetWheelSlipAngle(unsigned int idx) const {
        return mTires[idx]->GetSlipAngle();
    }

  public:
    struct Drift {
        Drift() : State(D_OUT), Value(0.0f) {}

        enum eState { D_OUT, D_ENTER, D_IN, D_EXIT } State; // offset 0x0, size 0x4
        float Value;                                        // offset 0x4, size 0x4

        void Reset() {
            State = SuspensionRacer::Drift::D_OUT;
            Value = 0.0f;
        }
    };

    struct Burnout {
        Burnout() : mState(0), mBurnOutTime(0.0f), mTraction(1.0f), mBurnOutAllow(0.0f) {}

        void Update(const float dT, const float speedmph, const float max_slip, const int max_slip_wheel, const float yaw);

        int GetState() {
            return mState;
        }

        float GetTraction() {
            return mTraction;
        }

        void Reset() {
            mState = 0;
            mBurnOutTime = 0.0f;
            mTraction = 1.0f;
            mBurnOutAllow = 0.0f;
        }

        void SetState(int s) {
            mState = s;
        }

        void SetBurnOutTime(float t) {
            mBurnOutTime = t;
        }

        void SetTraction(float t) {
            mTraction = t;
        }

        float GetBurnOutTime(float t) {
            return mBurnOutTime;
        }

        void DecBurnOutTime(float t) {
            mBurnOutTime -= t;
        }

        void ClearBurnOutAllow() {
            mBurnOutAllow = 0.0f;
        }

        void IncBurnOutAllow(float t) {
            mBurnOutAllow += t;
        }

      private:
        int mState;          // offset 0x0, size 0x4
        float mBurnOutTime;  // offset 0x4, size 0x4
        float mTraction;     // offset 0x8, size 0x4
        float mBurnOutAllow; // offset 0xC, size 0x4
    };

    struct Steering {
        Steering() : InputAverage(0.55f, 60.0f), InputSpeedCoeffAverage(0.15f, 60.0f) {
            Reset();
        }

        float Previous;                       // offset 0x0, size 0x4
        float Wheels[2];                      // offset 0x4, size 0x8
        float Maximum;                        // offset 0xC, size 0x4
        float LastMaximum;                    // offset 0x10, size 0x4
        float LastInput;                      // offset 0x14, size 0x4
        AverageWindow InputAverage;           // offset 0x18, size 0x38
        AverageWindow InputSpeedCoeffAverage; // offset 0x50, size 0x38
        float CollisionTimer;                 // offset 0x88, size 0x4
        float WallNoseTurn;                   // offset 0x8C, size 0x4
        float WallSideTurn;                   // offset 0x90, size 0x4
        float YawControl;                     // offset 0x94, size 0x4

        void Reset() {
            Previous = 0.0f;
            Wheels[1] = 0.0f;
            Wheels[0] = 0.0f;
            Maximum = 45.0f;
            LastMaximum = 45.0f;
            LastInput = 0.0f;
            InputAverage.Reset(0.0f);
            InputSpeedCoeffAverage.Reset(0.0f);
            CollisionTimer = 0.0f;
            WallNoseTurn = 0.0f;
            WallSideTurn = 0.0f;
            YawControl = 1.0f;
        }
    };

    struct Differential {
        void CalcSplit(bool locked);

        float angular_vel[2];
        int has_traction[2];
        float bias;
        float factor;
        float torque_split[2];
    };

    bool RearWheelDrive() {
        return mTranyInfo.TORQUE_SPLIT() < 1.0f;
    }

    bool FrontWheelDrive() {
        return mTranyInfo.TORQUE_SPLIT() > 0.0f;
    }

    bool IsDriveWheel(unsigned int i) {
        return (IsRear(i) && RearWheelDrive()) || (IsFront(i) && FrontWheelDrive());
    }

    Tire &GetWheel(unsigned int i) {
        return *mTires[i];
    }

    const Tire &GetWheel(unsigned int i) const {
        return *mTires[i];
    }

  private:
    BehaviorSpecsPtr<Attrib::Gen::tires> mTireInfo;         // offset 0x90, size 0x14
    BehaviorSpecsPtr<Attrib::Gen::brakes> mBrakeInfo;       // offset 0xA4, size 0x14
    BehaviorSpecsPtr<Attrib::Gen::chassis> mSuspensionInfo; // offset 0xB8, size 0x14
    BehaviorSpecsPtr<Attrib::Gen::transmission> mTranyInfo; // offset 0xCC, size 0x14
    IRigidBody *mRB;                                        // offset 0xE0, size 0x4
    ICollisionBody *mCollisionBody;                         // offset 0xE4, size 0x4
    ITransmission *mTransmission;                           // offset 0xE8, size 0x4
    IHumanAI *mHumanAI;                                     // offset 0xEC, size 0x4
    float mGameBreaker;                                     // offset 0xF0, size 0x4
    unsigned int mNumWheelsOnGround;                        // offset 0xF4, size 0x4
    float mLastGroundCollision;                             // offset 0xF8, size 0x4
    Drift mDrift;                                           // offset 0xFC, size 0x8
    Burnout mBurnOut;                                       // offset 0x104, size 0x10
    Steering mSteering;                                     // offset 0x114, size 0x98
    Tire *mTires[4];
};

float YawFrictionBoost(float yaw, float ebrake, float speed, float yawcontrol, float grade);

const float ZeroDegreeTable[6] = {0.0f};
float TwoDegreeTable[] = {0.0f, 1.2f, 2.3f, 3.0f, 3.0f, 2.8f};
float FourDegreeTable[] = {0.0f, 1.7f, 3.2f, 4.3f, 5.1f, 5.2f};
float SixDegreeTable[] = {0.0f, 1.8f, 3.5f, 4.9f, 5.8f, 6.1f};
float EightDegreeTable[] = {0.0f, 1.83f, 3.6f, 5.0f, 5.96f, 6.4f};
float TenDegreeTable[] = {0.0f, 1.86f, 3.7f, 5.1f, 6.13f, 6.7f};
float TwelveDegreeTable[] = {0.0f, 1.9f, 3.8f, 5.2f, 6.3f, 7.1f};

Table ZeroDegree = Table(ZeroDegreeTable, 6, 0.0f, 10.0f);
Table TwoDegree = Table(TwoDegreeTable, 6, 0.0f, 10.0f);
Table FourDegree = Table(FourDegreeTable, 6, 0.0f, 10.0f);
Table SixDegree = Table(SixDegreeTable, 6, 0.0f, 10.0f);
Table EightDegree = Table(EightDegreeTable, 6, 0.0f, 10.0f);
Table TenDegree = Table(TenDegreeTable, 6, 0.0f, 10.0f);
