
#include "Chassis.h"
#include "Speed/Indep/Libs/Support/Utility/UMath.h"
#include "Speed/Indep/Libs/Support/Utility/UTypes.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/brakes.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/chassis.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/tires.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/transmission.h"
#include "Speed/Indep/Src/Generated/Hash.hpp"
#include "Speed/Indep/Src/Interfaces/Simables/ICollisionBody.h"
#include "Speed/Indep/Src/Interfaces/Simables/IINput.h"
#include "Speed/Indep/Src/Interfaces/Simables/INISCarControl.h"
#include "Speed/Indep/Src/Interfaces/Simables/IVehicle.h"
#include "Speed/Indep/Src/Physics/Behavior.h"
#include "Speed/Indep/Src/Physics/Common/VehicleSystem.h"
#include "Speed/Indep/Src/Physics/PhysicsInfo.hpp"
#include "Speed/Indep/Src/Physics/Wheel.h"
#include "Speed/Indep/Src/Sim/Simulation.h"

#define EPSILON 0.000001f

// static const float Tweak_DefaultNISCarConstraint; // TODO value and use
static const bool Tweak_UseDefaultConstraint = false; // TODO use
// static const float MaxNISConstraint; // TODO value and use

#define MAKEATTRIB const

// total size: 0x198
class SuspensionSpline : public Chassis, public INISCarControl {
  public:
    // total size: 0x124
    class Tire : public Wheel {
      public:
        Tire(float radius);

        void SetLocked(bool locked) {
            this->mLocked = locked;
        }
        void SetBurnout(float speed) {
            this->mBurnout = speed;
        }

        float GetLoad() const {
            return this->mLoad;
        }
        float GetRadius() const {
            return this->mRadius;
        }

        float GetAngularVelocity() const {
            return this->mAV;
        }
        void SetAngularVelocity(float av) {
            this->mAV = av;
        }

        float GetCurrentSlip() const {
            return this->mSlip;
        }
        float GetTraction() const {
            return mLocked ? 0.0f : 1.0f;
        }

        void BeginFrame();
        void EndFrame(float dT);

        float GetLateralSpeed() const {
            return this->mLateralSpeed;
        }
        float GetRoadSpeed() const {
            return this->mRoadSpeed;
        }

        void MatchSpeed(Mps speed) {
            this->mLocked = false;
            this->mSlip = 0.0f;
            this->mRoadSpeed = speed;
            this->mSlipAngle = 0.0f;
            this->mLateralSpeed = 0.0f;
            this->mAV = speed / mRadius;
        }

        void UpdateLoaded(float lat_vel, float fwd_vel, float load, float dT);

        void UpdateFree(float dT);

        Angle GetSlipAngle() const {
            return this->mSlipAngle;
        }

      private:
        bool mLocked;        // offset 0xC4, size 0x1
        float mBurnout;      // offset 0xC8, size 0x4
        const float mRadius; // offset 0xCC, size 0x4
        float mAV;           // offset 0xD0, size 0x4
        float mSlip;         // offset 0xD4, size 0x4
        float mRoadSpeed;    // offset 0xD8, size 0x4
        float mSlipAngle;    // offset 0xDC, size 0x4
        float mLateralSpeed; // offset 0xE0, size 0x4
        float mLoad;         // offset 0xE4, size 0x4
    };

    SuspensionSpline(const BehaviorParams &bp, const SuspensionParams &sp);
    ~SuspensionSpline() override;
    static Behavior *Construct(const BehaviorParams &params);

    // Overrides: INISCarControl
    void SetBurnout(float speed) override {
        this->mBurnout = speed;
    }
    float GetBurnout() const override {
        return this->mBurnout;
    }
    void SetBrakeLock(bool front, bool rear) override {
        this->mBrakeLockFront = front;
        this->mBrakeLockRear = rear;
    }
    bool SetNISPosition(const struct UMath::Matrix4 &position, bool initial, float dT) override;
    void RestoreState() override;
    void SetConstraintAngle(Degrees angle) override {
        this->mConstraint = UMath::Clamp(angle, 0.0f, 80.0f);
    }
    void SetSteering(Angle angle, float weight) override {
        this->mNISSteering = UMath::Clamp(angle, -this->mMaxSteering, this->mMaxSteering);
        this->mNISSteeringWeight = UMath::Clamp(weight, 0.0f, 1.0f);
    }

    virtual void NISCarTweaks(float dT);

    float AngleToAIAngle(float x) {
        return x / 32768.0f;
    }

    // Overrides: INISCarControl
    void SetAnimPitch(float dip, float time) override {
        this->mAnimatedPitchLength = time;
        this->mAnimatedPitchTime = 0.0f;
        this->mAnimatedPitch = 0.0f;

        float length;
        this->GetWheelBase(nullptr, &length);
        if (dip < 0.0f) {
            this->mAnimatedPitchDelta = -AngleToAIAngle(static_cast<float>(bATan(length * 0.5f, -dip)));
        } else {
            this->mAnimatedPitchDelta = AngleToAIAngle(static_cast<float>(bATan(length * 0.5f, dip)));
        }
    }

    float GetAnimPitch() const override {
        return this->mAnimatedPitch;
    }
    void SetAnimRoll(float dip, float time) override {
        this->mAnimatedRollLength = time;
        this->mAnimatedRollTime = 0.0f;
        this->mAnimatedRoll = 0.0f;

        float width;
        this->GetWheelBase(&width, nullptr);
        if (dip < 0.0f) {
            this->mAnimatedRollDelta = -AngleToAIAngle(static_cast<float>(bATan(width * 0.5f, -dip)));
        } else {
            this->mAnimatedRollDelta = AngleToAIAngle(static_cast<float>(bATan(width * 0.5f, dip)));
        }
    }

    float GetAnimRoll() const override {
        return mAnimatedRoll;
    }
    void SetAnimShake(float dip, float cycleRate, float cycleRamp, float time) override {
        this->mAnimatedShakeLength = time;
        this->mAnimatedShakeTime = 0.0f;
        this->mAnimatedShake = 0.0f;
        this->mAnimatedShakeCycleRate = cycleRate;
        this->mAnimatedShakeRamp = cycleRamp;

        float width;
        this->GetWheelBase(&width, nullptr);
        if (dip < 0.0f) {
            this->mAnimatedShakeDelta = -AngleToAIAngle(static_cast<float>(bATan(width * 0.5f, -dip)));
        } else {
            this->mAnimatedShakeDelta = AngleToAIAngle(static_cast<float>(bATan(width * 0.5f, dip)));
        }
    }

    float GetAnimShake() const override {
        return this->mAnimatedShake;
    }

    // Overrides: ISuspension
    void MatchSpeed(float speed) override;
    float GetWheelAngularVelocity(int index) const override {
        return this->mTires[index]->GetAngularVelocity();
    }
    float GetWheelRadius(unsigned int index) const override {
        return this->mTires[index]->GetRadius();
    }
    float GetWheelSlip(unsigned int idx) const override {
        return this->mTires[idx]->GetCurrentSlip();
    }
    Mps GetToleratedSlip(unsigned int idx) const override {
        return 0.5f;
    }
    float GetWheelSkid(unsigned int idx) const override {
        return this->mTires[idx]->GetLateralSpeed();
    }
    Newtons GetWheelLoad(unsigned int i) const override {
        return this->mTires[i]->GetLoad();
    }
    float GetWheelTraction(unsigned int index) const override {
        return this->mTires[index]->GetTraction();
    }
    void SetWheelAngularVelocity(int wheel, float w) override {}
    unsigned int GetNumWheels() const override {
        return 4;
    }
    const UMath::Vector3 &GetWheelPos(unsigned int i) const override {
        return this->mTires[i]->GetPosition();
    }
    const UMath::Vector3 &GetWheelLocalPos(unsigned int i) const override {
        return this->mTires[i]->GetLocalArm();
    }
    UMath::Vector3 GetWheelCenterPos(unsigned int i) const override;
    void ApplyVehicleEntryForces(bool enteringVehicle, const UMath::Vector3 &pos, bool calledfromEvent) override {}

    // Overrides: ISuspension
    const float GetWheelRoadHeight(unsigned int i) const override {
        return this->mTires[i]->GetNormal().w;
    }
    float GetCompression(unsigned int i) const override {
        return this->mTires[i]->GetCompression();
    }
    const UMath::Vector4 &GetWheelRoadNormal(unsigned int i) const override {
        return this->mTires[i]->GetNormal();
    }
    bool IsWheelOnGround(unsigned int i) const override {
        return this->mTires[i]->IsOnGround();
    }
    const SimSurface &GetWheelRoadSurface(unsigned int i) const override {
        return this->mTires[i]->GetSurface();
    }
    const UMath::Vector3 &GetWheelVelocity(unsigned int i) const override {
        return this->mTires[i]->GetVelocity();
    }
    int GetNumWheelsOnGround() const override {
        return this->mNumWheelsOnGround;
    }
    Angle GetWheelSteer(unsigned int wheel) const override {
        return wheel < 2 ? this->mSteering : 0.0f;
    }
    Angle GetMaxSteering() const override {
        return this->mMaxSteering;
    }
    Angle GetWheelSlipAngle(unsigned int idx) const override {
        return this->mTires[idx]->GetSlipAngle();
    }

    // Behavior
    void OnTaskSimulate(float dT) override;
    void Reset() override;

  protected:
    void DoWheelForces(State &state);
    void DoSteering(State &state, UMath::Vector3 &right, UMath::Vector3 &left);

    // Behavior
    void OnBehaviorChange(const UCrc32 &mechanic) override;

    Tire &GetWheel(unsigned int i) {
        return *this->mTires[i];
    }

    const Tire &GetWheel(unsigned int i) const {
        return *this->mTires[i];
    }

  private:
    void GetWheelBase(float *width, float *length);

    BehaviorSpecsPtr<Attrib::Gen::tires> mTireInfo;              // offset 0x9C, size 0x14
    BehaviorSpecsPtr<Attrib::Gen::chassis> mSuspensionInfo;      // offset 0xB0, size 0x14
    BehaviorSpecsPtr<Attrib::Gen::transmission> mDrivetrainInfo; // offset 0xC4, size 0x14
    IRigidBody *mRB;                                             // offset 0xD8, size 0x4
    ICollisionBody *mCollisionBody;                              // offset 0xDC, size 0x4
    IInput *mInput;                                              // offset 0xE0, size 0x4
    IEngine *mIEngine;                                           // offset 0xE4, size 0x4
    unsigned int mNumWheelsOnGround;                             // offset 0xE8, size 0x4
    const Angle mMaxSteering;                                    // offset 0xEC, size 0x4
    Angle mSteering;                                             // offset 0xF0, size 0x4
    Angle mNISSteering;                                          // offset 0xF4, size 0x4
    float mNISSteeringWeight;                                    // offset 0xF8, size 0x4
    float mTimeInAir;                                            // offset 0xFC, size 0x4
    float mBurnout;                                              // offset 0x100, size 0x4
    bool mBrakeLockFront;                                        // offset 0x104, size 0x1
    bool mBrakeLockRear;                                         // offset 0x108, size 0x1
    Degrees mConstraint;                                         // offset 0x10C, size 0x4
    UMath::Matrix4 mNISPosition;                                 // offset 0x110, size 0x40
    float mAnimatedPitchLength;                                  // offset 0x150, size 0x4
    float mAnimatedPitch;                                        // offset 0x154, size 0x4
    float mAnimatedPitchDelta;                                   // offset 0x158, size 0x4
    float mAnimatedPitchTime;                                    // offset 0x15C, size 0x4
    float mAnimatedRollLength;                                   // offset 0x160, size 0x4
    float mAnimatedRoll;                                         // offset 0x164, size 0x4
    float mAnimatedRollDelta;                                    // offset 0x168, size 0x4
    float mAnimatedRollTime;                                     // offset 0x16C, size 0x4
    float mAnimatedShakeLength;                                  // offset 0x170, size 0x4
    float mAnimatedShakeCycleRate;                               // offset 0x174, size 0x4
    float mAnimatedShakeRamp;                                    // offset 0x178, size 0x4
    float mAnimatedShake;                                        // offset 0x17C, size 0x4
    float mAnimatedShakeDelta;                                   // offset 0x180, size 0x4
    float mAnimatedShakeTime;                                    // offset 0x184, size 0x4
    Tire *mTires[4];                                             // offset 0x188, size 0x10
};

BIND_BEHAVIOR_FACTORY(SuspensionSpline);

SuspensionSpline::Tire::Tire(float radius)
    : Wheel(0),                          //
      mLocked(false),                    //
      mBurnout(0.0f),                    //
      mRadius(UMath::Max(radius, 0.1f)), //
      mAV(0.0f),                         //
      mSlip(0.0f),                       //
      mRoadSpeed(0.0f),                  //
      mSlipAngle(0.0f),                  //
      mLateralSpeed(0.0f),               //
      mLoad(0.0f) {}

void SuspensionSpline::Tire::BeginFrame() {
    this->SetForce(UMath::Vector3::kZero);
    this->mLoad = 0.0f;
}

void SuspensionSpline::Tire::EndFrame(float dT) {}

void SuspensionSpline::Tire::UpdateFree(float dT) {
    this->mSlip = 0.0f;
    this->mSlipAngle = 0.0f;
    if (this->mLocked) {
        this->mAV = 0.0f;
    }
}

Behavior *SuspensionSpline::Construct(const BehaviorParams &params) {
