#include "Speed/Indep/Libs/Support/Utility/UMath.h"
#include "Speed/Indep/Libs/Support/Utility/UVector.h"
#include "Speed/Indep/Src/Debug/Debugable.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/brakes.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/chassis.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/tires.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/transmission.h"
#include "Speed/Indep/Src/Generated/Hash.hpp"
#include "Speed/Indep/Src/Input/ISteeringWheel.h"
#include "Speed/Indep/Src/Interfaces/IAttributeable.h"
#include "Speed/Indep/Src/Interfaces/IListener.h"
#include "Speed/Indep/Src/Interfaces/SimEntities/IPlayer.h"
#include "Speed/Indep/Src/Interfaces/Simables/IAI.h"
#include "Speed/Indep/Src/Interfaces/Simables/IRigidBody.h"
#include "Speed/Indep/Src/Interfaces/Simables/ISimable.h"
#include "Speed/Indep/Src/Interfaces/Simables/ISuspension.h"
#include "Speed/Indep/Src/Interfaces/Simables/IVehicle.h"
#include "Speed/Indep/Src/Misc/Table.hpp"
#include "Speed/Indep/Src/Physics/Behavior.h"
#include "Speed/Indep/Src/Physics/Behaviors/Chassis.h"
#include "Speed/Indep/Src/Physics/Common/VehicleSystem.h"
#include "Speed/Indep/Src/Physics/PhysicsInfo.hpp"
#include "Speed/Indep/Src/Physics/PhysicsTunings.h"
#include "Speed/Indep/Src/Physics/Wheel.h"
#include "Speed/Indep/Src/Sim/Collision.h"
#include "Speed/Indep/Src/Sim/Simulation.h"
#include "Speed/Indep/Tools/Inc/ConversionUtil.hpp"

#define EPSILON 0.000001f

static const int DoYawControl = 1; // TODO use

#define LOAD_SENSITIVITY_TABLE_SPACING 2.0f
#define LOAD_SENSITIVITY_MAX_LOAD 10.0f
#define NUM_SLIP_ANGLE_TABLES 7

const float ZeroDegreeTable[6] = {0.0f};
float TwoDegreeTable[] = {0.0f, 1.2f, 2.3f, 3.0f, 3.0f, 2.8f};
float FourDegreeTable[] = {0.0f, 1.7f, 3.2f, 4.3f, 5.1f, 5.2f};
float SixDegreeTable[] = {0.0f, 1.8f, 3.5f, 4.9f, 5.8f, 6.1f};
float EightDegreeTable[] = {0.0f, 1.83f, 3.6f, 5.0f, 5.96f, 6.4f};
float TenDegreeTable[] = {0.0f, 1.86f, 3.7f, 5.1f, 6.13f, 6.7f};
float TwelveDegreeTable[] = {0.0f, 1.9f, 3.8f, 5.2f, 6.3f, 7.1f};

Table ZeroDegree = Table(ZeroDegreeTable, 6, 0.0f, 10.0f);
Table TwoDegree = Table(TwoDegreeTable, 6, 0.0f, 10.0f);
Table FourDegree = Table(FourDegreeTable, 6, 0.0f, 10.0f);
Table SixDegree = Table(SixDegreeTable, 6, 0.0f, 10.0f);
Table EightDegree = Table(EightDegreeTable, 6, 0.0f, 10.0f);
Table TenDegree = Table(TenDegreeTable, 6, 0.0f, 10.0f);
Table TwelveDegree = Table(TwelveDegreeTable, 6, 0.0f, 10.0f);

#ifdef TARGET_WIN32
// DRM protected variable
int *pLatForceMultipliers = nullptr;
#endif
Table *LoadSensitivityTable[] = {&ZeroDegree, &TwoDegree, &FourDegree, &SixDegree, &EightDegree, &TenDegree, &TwelveDegree};

#define MAKEATTRIB const

float MaxSlipAngle = 12.0f;

static const float STEERING_INPUT_WINDOW = 0.55f;
static const float STEERING_INPUT_SPEED_WINDOW = 0.15f;

static const float Tweak_TuningRide_Height = 0.0f; // TODO value and usage
static const float Tweak_TuningBrakes_Bias = 0.0f; // TODO value and usage
static const float Tweak_TuningHandling_Grip = 0.2f;

// Credits: Brawltendo
// total size: 0x140
class SuspensionRacer : public Chassis, public Sim::Collision::IListener, public IAttributeable, Debugable {
  public:
    class Tire : public Wheel {
      public:
        enum LastRotationSign {
            WAS_POSITIVE = 0,
            WAS_ZERO = 1,
            WAS_NEGATIVE = 2,
        };

        Tire(float radius, int index, const Attrib::Gen::tires *specs, const Attrib::Gen::brakes *brakes);

        void SetBrake(float brake) {
            this->mBrake = brake;
        }
        void SetEBrake(float ebrake) {
            this->mEBrake = ebrake;
        }
        float GetEBrake() const {
            return this->mEBrake;
        }

        float GetTraction() const {
            return this->mTraction;
        }
        float GetRadius() const {
            return this->mRadius;
        }
        Radians GetAngularVelocity() const {
            return this->mAV;
        }
        Radians GetAngularAcceleration() const {
            return this->mAngularAcc;
        }
        void SetAngularVelocity(Radians w) {
            this->mAV = w;
        }
        Newtons GetLoad() const {
            return this->mLoad;
        }

        Mps GetCurrentSlip() const {
            return this->mSlip;
        }
        Mps GetToleratedSlip() const {
            return this->mMaxSlip;
        }

        void SetLateralBoost(float f) {
            this->mLateralBoost = f;
        }

        void SetBottomOutTime(Seconds time) {
            this->mBottomOutTime = time;
        }
        Seconds GetBottomOutTime() const {
            return this->mBottomOutTime;
        }

        void ScaleTractionBoost(float scale) {
            this->mTractionBoost *= scale;
        }
        void SetDriftFriction(float scale) {
            this->mDriftFriction = scale;
        }

        void BeginFrame(float max_slip, float grip_boost, float traction_boost, float drag_reduction);
        void EndFrame(float dT);

        void ApplyDriveTorque(float torque) {
            if (!this->mBrakeLocked) {
                this->mDriveTorque += torque;
            }
        }

        void ApplyBrakeTorque(float torque) {
            if (!this->mBrakeLocked) {
                this->mBrakeTorque += torque;
            }
        }

        Nm GetTotalTorque() const {
            return this->mDriveTorque + this->mBrakeTorque;
        }
        Nm GetDriveTorque() const {
            return this->mDriveTorque;
        }
        Nm GetBrakeTorque() const {
            return this->mBrakeTorque;
        }

        Newtons GetLateralForce() const {
            return this->mLateralForce;
        }
        Newtons GetLongitudeForce() const {
            return this->mLongitudeForce;
        }

        bool IsBrakeLocked() const {
            return this->mBrakeLocked;
        }

        bool IsSteeringWheel() const {
            return this->mWheelIndex < 2;
        }

        void SetTractionCircle(const UMath::Vector2 &circle) {
            this->mTractionCircle = circle;
        }

        Mps GetRoadSpeed() const {
            return this->mRoadSpeed;
        }
        Mps GetLateralSpeed() const {
            return this->mLateralSpeed;
        }

        bool IsSlipping() const {
            return this->mTraction >= 1.0f;
        }

        float UpdateLoaded(float lat_vel, float fwd_vel, float body_speed, float load, float dT);
        void UpdateFree(float dT);

        Angle GetSlipAngle() const {
            return this->mSlipAngle;
        }

        void MatchSpeed(Mps speed) {
            this->mAV = speed / mRadius;
            this->mRoadSpeed = speed;
            this->mTraction = 1.0f;
            this->mBrakeLocked = false;
            this->mSlip = 0.0f;
            this->mAngularAcc = 0.0f;
            this->mLastTorque = 0.0f;
            this->mBrake = 0.0f;
            this->mEBrake = 0.0f;
            this->mLateralSpeed = 0.0f;
        }

      private:
        void CheckSign();
        void CheckForBrakeLock(float ground_force);
        float GetPilotFactor(const float speed);
        float ComputeLateralForce(float load, float slip_angle);

        const Meters mRadius;               // offset 0xC4, size 0x4
        float mBrake;                       // offset 0xC8, size 0x4
        float mEBrake;                      // offset 0xCC, size 0x4
        Radians mAV;                        // offset 0xD0, size 0x4
        Newtons mLoad;                      // offset 0xD4, size 0x4
        Newtons mLateralForce;              // offset 0xD8, size 0x4
        Newtons mLongitudeForce;            // offset 0xDC, size 0x4
        Nm mDriveTorque;                    // offset 0xE0, size 0x4
        Nm mBrakeTorque;                    // offset 0xE4, size 0x4
        float mLateralBoost;                // offset 0xE8, size 0x4
        float mTractionBoost;               // offset 0xEC, size 0x4
        Mps mSlip;                          // offset 0xF0, size 0x4
        Newtons mLastTorque;                // offset 0xF4, size 0x4
        const int mWheelIndex;              // offset 0xF8, size 0x4
        Mps mRoadSpeed;                     // offset 0xFC, size 0x4
        const Attrib::Gen::tires *mSpecs;   // offset 0x100, size 0x4
        const Attrib::Gen::brakes *mBrakes; // offset 0x104, size 0x4
        Radians mAngularAcc;                // offset 0x108, size 0x4
        const int mAxleIndex;               // offset 0x10C, size 0x4
        float mTraction;                    // offset 0x110, size 0x4
        Seconds mBottomOutTime;             // offset 0x114, size 0x4
        Angle mSlipAngle;                   // offset 0x118, size 0x4
        UMath::Vector2 mTractionCircle;     // offset 0x11C, size 0x8
        Mps mMaxSlip;                       // offset 0x124, size 0x4
        float mGripBoost;                   // offset 0x128, size 0x4
        float mDriftFriction;               // offset 0x12C, size 0x4
        Mps mLateralSpeed;                  // offset 0x130, size 0x4
        bool mBrakeLocked;                  // offset 0x134, size 0x4
        LastRotationSign mLastSign;         // offset 0x138, size 0x4
        float mDragReduction;               // offset 0x13C, size 0x4
    };

    SuspensionRacer(const BehaviorParams &bp, const SuspensionParams &sp);
    ~SuspensionRacer() override;
    static Behavior *Construct(const BehaviorParams &params);

    void OnAttributeChange(const Attrib::Collection *aspec, Attrib::Key attribkey) override;
    virtual void OnDebugDraw();
    void MatchSpeed(Mps speed) override;

    float GetWheelTraction(unsigned int index) const override {
        return this->mTires[index]->GetTraction();
    }

    Radians GetWheelAngularVelocity(int index) const override;

    float GetWheelRadius(unsigned int index) const override {
        return this->mTires[index]->GetRadius();
    }
    float GetWheelSlip(unsigned int idx) const override {
        return this->mTires[idx]->GetCurrentSlip();
    }
    float GetToleratedSlip(unsigned int idx) const override {
        return this->mTires[idx]->GetToleratedSlip();
    }
    float GetWheelSkid(unsigned int idx) const override {
        return this->mTires[idx]->GetLateralSpeed();
    }

    Meters GetRideHeight(unsigned int idx) const override;

    float GetWheelLoad(unsigned int i) const override {
        return this->mTires[i]->GetLoad();
    }
    void SetWheelAngularVelocity(int wheel, float w) override {
        this->mTires[wheel]->SetAngularVelocity(w);
    }
    unsigned int GetNumWheels() const override {
        return 4;
    }
    const UMath::Vector3 &GetWheelPos(unsigned int i) const override {
        return this->mTires[i]->GetPosition();
    }
    const UMath::Vector3 &GetWheelLocalPos(unsigned int i) const override {
        return this->mTires[i]->GetLocalArm();
    }

    UMath::Vector3 GetWheelCenterPos(unsigned int i) const override;

    void ApplyVehicleEntryForces(bool enteringVehicle, const UMath::Vector3 &pos, bool calledfromEvent) override {}
    const float GetWheelRoadHeight(unsigned int i) const override {
        return this->mTires[i]->GetNormal().w;
    }
    float GetCompression(unsigned int i) const override {
        return this->mTires[i]->GetCompression();
    }
    const UMath::Vector4 &GetWheelRoadNormal(unsigned int i) const override {
        return this->mTires[i]->GetNormal();
    }
    bool IsWheelOnGround(unsigned int i) const override {
        return this->mTires[i]->IsOnGround();
    }
    const SimSurface &GetWheelRoadSurface(unsigned int i) const override {
        return this->mTires[i]->GetSurface();
    }
    const UMath::Vector3 &GetWheelVelocity(unsigned int i) const override {
        return this->mTires[i]->GetVelocity();
    }
    int GetNumWheelsOnGround() const override {
        return this->mNumWheelsOnGround;
    }
    float GetWheelSteer(unsigned int wheel) const override {
        return wheel < 2 ? RAD2ANGLE(this->mSteering.Wheels[wheel]) : 0.0f;
    }
    float GetMaxSteering() const override {
        return DEG2ANGLE(this->mSteering.Maximum);
    }
    float GetWheelSlipAngle(unsigned int idx) const override {
        return this->mTires[idx]->GetSlipAngle();
    }

    void OnCollision(const COLLISION_INFO &cinfo) override;
    void OnTaskSimulate(float dT) override;
    void Reset() override;

  protected:
    void DoWheelForces(Chassis::State &state);
    void DoDriveForces(Chassis::State &state);
    void DoSteering(Chassis::State &state, UMath::Vector3 &right, UMath::Vector3 &left);
    void DoWallSteer(Chassis::State &state);
    void DoAerobatics(Chassis::State &state);
    float DoAISteering(Chassis::State &state);
    float DoHumanSteering(Chassis::State &state);
    float CalculateMaxSteering(Chassis::State &state, ISteeringWheel::SteeringType steer_type);
    float CalculateSteeringSpeed(Chassis::State &state);
    void TuneWheelParams(Chassis::State &state);
    void DoDrifting(const Chassis::State &state);

    bool RearWheelDrive() {
        return this->mTranyInfo.TORQUE_SPLIT() < 1.0f;
    }
    bool FrontWheelDrive() {
        return this->mTranyInfo.TORQUE_SPLIT() > 0.0f;
    }
    bool IsDriveWheel(unsigned int i) {
        return (Physics::Wheels::IsRear(i) && this->RearWheelDrive()) || (Physics::Wheels::IsFront(i) && this->FrontWheelDrive());
    }

    void OnBehaviorChange(const UCrc32 &mechanic) override;

    struct Differential {
        float angular_vel[2];
        int has_traction[2];
        float bias;
        float factor;
        float torque_split[2];

        void CalcSplit(bool locked);
    };

    Tire &GetWheel(unsigned int i) {
        return *this->mTires[i];
    }

    const Tire &GetWheel(unsigned int i) const {
        return *this->mTires[i];
    }

    struct Burnout {
        Burnout() : mState(0), mBurnOutTime(0.0f), mTraction(1.0f), mBurnOutAllow(0.0f) {}

        void Update(const float dT, const float speedmph, const float max_slip, const int max_slip_wheel, const float yaw);

        int GetState() {
            return this->mState;
        }

        float GetTraction() {
            return this->mTraction;
        }

        void Reset() {
            this->mState = 0;
            this->mBurnOutTime = 0.0f;
            this->mTraction = 1.0f;
            this->mBurnOutAllow = 0.0f;
        }

        void SetState(int s) {
            this->mState = s;
        }

        void SetBurnOutTime(float t) {
            this->mBurnOutTime = t;
        }

        void SetTraction(float t) {
            this->mTraction = t;
        }

        float GetBurnOutTime(float t) {
            return this->mBurnOutTime;
        }

        void DecBurnOutTime(float t) {
            this->mBurnOutTime -= t;
        }

        void ClearBurnOutAllow() {
            this->mBurnOutAllow = 0.0f;
        }

        void IncBurnOutAllow(float t) {
            this->mBurnOutAllow += t;
        }

      private:
        int mState;          // offset 0x0, size 0x4
        float mBurnOutTime;  // offset 0x4, size 0x4
        float mTraction;     // offset 0x8, size 0x4
        float mBurnOutAllow; // offset 0xC, size 0x4
    };

    struct Steering {
        Steering() : InputAverage(STEERING_INPUT_WINDOW, 60.0f), InputSpeedCoeffAverage(STEERING_INPUT_SPEED_WINDOW, 60.0f) {
            this->Reset();
        }

        void Reset() {
            this->Previous = 0.0f;
            this->Wheels[1] = 0.0f;
            this->Wheels[0] = 0.0f;
            this->Maximum = ABSOLUTE_MAX_STEERING;
            this->LastMaximum = ABSOLUTE_MAX_STEERING;
            this->LastInput = 0.0f;
            this->InputAverage.Reset(0.0f);
            this->InputSpeedCoeffAverage.Reset(0.0f);
            this->CollisionTimer = 0.0f;
            this->WallNoseTurn = 0.0f;
            this->WallSideTurn = 0.0f;
            this->YawControl = 1.0f;
        }

        float Previous;                       // offset 0x0, size 0x4
        float Wheels[2];                      // offset 0x4, size 0x8
        float Maximum;                        // offset 0xC, size 0x4
        float LastMaximum;                    // offset 0x10, size 0x4
        float LastInput;                      // offset 0x14, size 0x4
        AverageWindow InputAverage;           // offset 0x18, size 0x38
        AverageWindow InputSpeedCoeffAverage; // offset 0x50, size 0x38
        float CollisionTimer;                 // offset 0x88, size 0x4
        float WallNoseTurn;                   // offset 0x8C, size 0x4
        float WallSideTurn;                   // offset 0x90, size 0x4
        float YawControl;                     // offset 0x94, size 0x4
    };

    struct Drift {
        Drift() : State(D_OUT), Value(0.0f) {}

        void Reset() {
            this->State = SuspensionRacer::Drift::D_OUT;
            this->Value = 0.0f;
        }

        enum eState { D_OUT, D_ENTER, D_IN, D_EXIT };

        eState State; // offset 0x0, size 0x4
        float Value;  // offset 0x4, size 0x4
    };

  private:
    void CreateTires();
    float CalcYawControlLimit(float speed) const;

    BehaviorSpecsPtr<Attrib::Gen::tires> mTireInfo;         // offset 0x90, size 0x14
    BehaviorSpecsPtr<Attrib::Gen::brakes> mBrakeInfo;       // offset 0xA4, size 0x14
    BehaviorSpecsPtr<Attrib::Gen::chassis> mSuspensionInfo; // offset 0xB8, size 0x14
    BehaviorSpecsPtr<Attrib::Gen::transmission> mTranyInfo; // offset 0xCC, size 0x14
    IRigidBody *mRB;                                        // offset 0xE0, size 0x4
    ICollisionBody *mCollisionBody;                         // offset 0xE4, size 0x4
    ITransmission *mTransmission;                           // offset 0xE8, size 0x4
    IHumanAI *mHumanAI;                                     // offset 0xEC, size 0x4
    float mGameBreaker;                                     // offset 0xF0, size 0x4
    unsigned int mNumWheelsOnGround;                        // offset 0xF4, size 0x4
    Seconds mLastGroundCollision;                           // offset 0xF8, size 0x4
    Drift mDrift;                                           // offset 0xFC, size 0x8
    Burnout mBurnOut;                                       // offset 0x104, size 0x10
    Steering mSteering;                                     // offset 0x114, size 0x98
    Tire *mTires[4];
};

SuspensionRacer::Tire::Tire(float radius, int index, const Attrib::Gen::tires *specs, const Attrib::Gen::brakes *brakes)
    : Wheel(1),                                        //
      mRadius(UMath::Max(radius, 0.1f)),               //
      mWheelIndex(index),                              //
      mAxleIndex(index >> 1),                          //
      mSpecs(specs),                                   //
      mBrakes(brakes),                                 //
      mBrake(0.0f),                                    //
      mEBrake(0.0f),                                   //
      mAV(0.0f),                                       //
      mLoad(0.0f),                                     //
      mLateralForce(0.0f),                             //
      mLongitudeForce(0.0f),                           //
      mDriveTorque(0.0f),                              //
