#ifndef _attrib_gen_ecar_h
#define _attrib_gen_ecar_h

#include "Speed/Indep/Src/Misc/MWAttribUserTypes.h"

namespace Attrib {
namespace Gen {

struct ecar : Instance {
    struct _LayoutStruct {
        Private _Array_TireOffsets;                   // offset 0x0, size 0x8
        char _Pad_TireOffsets[8];                     // offset 0x8, size 0x8
        UMath::Vector4 TireOffsets[4];                // offset 0x10, size 0x40
        Private _Array_TireSkidWidthKitScale;         // offset 0x50, size 0x8
        UMath::Vector2 TireSkidWidthKitScale[7];      // offset 0x58, size 0x38
        Private _Array_SkidFX;                        // offset 0x90, size 0x8
        EA::Reflection::Float SkidFX[2];              // offset 0x98, size 0x8
        CarBodyMotion BodyRoll;                       // offset 0xa0, size 0xc
        CarBodyMotion BodySquat;                      // offset 0xac, size 0xc
        CarBodyMotion BodyDive;                       // offset 0xb8, size 0xc
        Private _Array_SlipFX;                        // offset 0xc4, size 0x8
        EA::Reflection::Float SlipFX[2];              // offset 0xcc, size 0x8
        Private _Array_TireSkidWidth;                 // offset 0xd4, size 0x8
        EA::Reflection::Float TireSkidWidth[4];       // offset 0xdc, size 0x10
        EA::Reflection::Text CollectionName;          // offset 0xec, size 0x4
        EA::Reflection::Float CamberFront;            // offset 0xf0, size 0x4
        EA::Reflection::Float ReflectionOffset;       // offset 0xf4, size 0x4
        EA::Reflection::Float CamberRear;             // offset 0xf8, size 0x4
        EA::Reflection::Float RideHeight;             // offset 0xfc, size 0x4
        Private _Array_KitWheelOffsetRear;            // offset 0x100, size 0x8
        EA::Reflection::UInt8 KitWheelOffsetRear[6];  // offset 0x108, size 0x6
        Private _Array_KitWheelOffsetFront;           // offset 0x10e, size 0x8
        EA::Reflection::UInt8 KitWheelOffsetFront[6]; // offset 0x116, size 0x6
        EA::Reflection::Int8 WheelSpokeCount;         // offset 0x11c, size 0x1
    };

    typedef CarBodyMotion TypeOf_BodyDive;
    typedef CarBodyMotion TypeOf_BodyRoll;
    typedef CarBodyMotion TypeOf_BodySquat;
    typedef EA::Reflection::Float TypeOf_CamberFront;
    typedef EA::Reflection::Float TypeOf_CamberRear;
    typedef RefSpec TypeOf_CameraInfo_Bumper;
    typedef RefSpec TypeOf_CameraInfo_Close;
    typedef RefSpec TypeOf_CameraInfo_Drift;
    typedef RefSpec TypeOf_CameraInfo_Far;
    typedef RefSpec TypeOf_CameraInfo_Hood;
    typedef RefSpec TypeOf_CameraInfo_Pursuit;
    typedef RefSpec TypeOf_CameraInfo_SuperFar;
    typedef EA::Reflection::Text TypeOf_CollectionName;
    typedef RefSpec TypeOf_DamageEffect;
    typedef RefSpec TypeOf_DeathEffect;
    typedef RefSpec TypeOf_EngineBlownEffect;
    typedef EA::Reflection::Float TypeOf_EngineRev;
    typedef EA::Reflection::Float TypeOf_EngineRevAngle;
    typedef EA::Reflection::Float TypeOf_EngineRevSpeed;
