#ifndef _attrib_gen_emitterdata_h
#define _attrib_gen_emitterdata_h

#include "Speed/Indep/Src/Misc/MWAttribUserTypes.h"

namespace Attrib {
namespace Gen {

struct emitterdata : Instance {
    struct _LayoutStruct {
        UMath::Vector4 VelocityStart;                        // offset 0x0, size 0x10
        UMath::Vector4 AccelDelta;                           // offset 0x10, size 0x10
        UMath::Vector4 RelativeAngle;                        // offset 0x20, size 0x10
        UMath::Vector4 VelocityDelta;                        // offset 0x30, size 0x10
        UMath::Vector4 Size;                                 // offset 0x40, size 0x10
        UMath::Vector4 KeyPositions;                         // offset 0x50, size 0x10
        UMath::Vector4 VolumeExtent;                         // offset 0x60, size 0x10
        UMath::Vector4 AccelStart;                           // offset 0x70, size 0x10
        UMath::Vector4 VolumeCenter;                         // offset 0x80, size 0x10
        ParticleAnimationInfo TextureAnimation;              // offset 0x90, size 0x8
        ParticleTextureRecord Texture;                       // offset 0x98, size 0x8
        EA::Reflection::Text CollectionName;                 // offset 0xa0, size 0x4
        EA::Reflection::Float InitialAngleRange;             // offset 0xa4, size 0x4
        EA::Reflection::Float Drag;                          // offset 0xa8, size 0x4
        EA::Reflection::UInt32 Color1;                       // offset 0xac, size 0x4
        EA::Reflection::UInt32 Color3;                       // offset 0xb0, size 0x4
        EA::Reflection::UInt32 Color4;                       // offset 0xb4, size 0x4
        EA::Reflection::Float OnCycle;                       // offset 0xb8, size 0x4
        EA::Reflection::Float Life;                          // offset 0xbc, size 0x4
        EA::Reflection::Float NumParticlesVariance;          // offset 0xc0, size 0x4
        EA::Reflection::Float NumParticles;                  // offset 0xc4, size 0x4
        EffectParticleConstraint AxisConstraint;             // offset 0xc8, size 0x4
        EA::Reflection::Float OnCycleVariance;               // offset 0xcc, size 0x4
        EA::Reflection::Float OffCycleVariance;              // offset 0xd0, size 0x4
        EA::Reflection::Float FarClip;                       // offset 0xd4, size 0x4
        EA::Reflection::Float OffCycle;                      // offset 0xd8, size 0x4
        EA::Reflection::Float RotationVariance;              // offset 0xdc, size 0x4
        EA::Reflection::Int32 MotionLive;                    // offset 0xe0, size 0x4
        EA::Reflection::UInt32 Color2;                       // offset 0xe4, size 0x4
        EA::Reflection::Float LifeVariance;                  // offset 0xe8, size 0x4
        EA::Reflection::Float MotionInherit;                 // offset 0xec, size 0x4
        EA::Reflection::Float Speed;                         // offset 0xf0, size 0x4
        EA::Reflection::Float StartDelay;                    // offset 0xf4, size 0x4
        EA::Reflection::Float SpreadAngle;                   // offset 0xf8, size 0x4
        EA::Reflection::Int32 RandomRotationDirection;       // offset 0xfc, size 0x4
        EA::Reflection::Float SpeedVariance;                 // offset 0x100, size 0x4
        EA::Reflection::Float MotionInheritVariance;         // offset 0x104, size 0x4
        EA::Reflection::Float Gravity;                       // offset 0x108, size 0x4
        EA::Reflection::Int32 SpreadAsDisc;                  // offset 0x10c, size 0x4
        EA::Reflection::Int8 AlphaToKillAt;                  // offset 0x110, size 0x1
        EA::Reflection::Bool NoKillAtAlpha;                  // offset 0x111, size 0x1
        EA::Reflection::Bool IsOneShot;                      // offset 0x112, size 0x1
        EA::Reflection::Bool StartDelayRandomVariance;       // offset 0x113, size 0x1
        EA::Reflection::Bool EliminateUnnecessaryRandomness; // offset 0x114, size 0x1
    };

    typedef UMath::Vector4 TypeOf_AccelDelta;
    typedef UMath::Vector4 TypeOf_AccelStart;
    typedef EA::Reflection::Int8 TypeOf_AlphaToKillAt;
    typedef EffectParticleConstraint TypeOf_AxisConstraint;
    typedef EA::Reflection::Text TypeOf_CollectionName;
    typedef EA::Reflection::UInt32 TypeOf_Color1;
    typedef EA::Reflection::UInt32 TypeOf_Color2;
    typedef EA::Reflection::UInt32 TypeOf_Color3;
    typedef EA::Reflection::UInt32 TypeOf_Color4;
    typedef EA::Reflection::Float TypeOf_Drag;
    typedef EA::Reflection::Bool TypeOf_EliminateUnnecessaryRandomness;
    typedef EA::Reflection::Float TypeOf_FarClip;
    typedef EA::Reflection::Float TypeOf_Gravity;
    typedef EA::Reflection::Float TypeOf_InitialAngleRange;
    typedef EA::Reflection::Bool TypeOf_IsOneShot;
    typedef UMath::Vector4 TypeOf_KeyPositions;
    typedef EA::Reflection::Float TypeOf_Life;
