#ifndef _attrib_gen_engineaudio_h
#define _attrib_gen_engineaudio_h

#include "Speed/Indep/Src/Misc/MWAttribUserTypes.h"

namespace Attrib {
namespace Gen {

struct engineaudio : Instance {
    struct _LayoutStruct {
        Attrib::StringKey Filename_GinsuDecel;        // offset 0x0, size 0x10
        Attrib::StringKey BankName_mainRAM;           // offset 0x10, size 0x10
        Attrib::StringKey Filename_GinsuAccel;        // offset 0x20, size 0x10
        RefSpec acceltrans;                           // offset 0x30, size 0xc
        EA::Reflection::Text CollectionName;          // offset 0x3c, size 0x4
        eENGINE_GROUP EngType;                        // offset 0x40, size 0x4
        EA::Reflection::UInt32 DECEL_AEMSVol;         // offset 0x44, size 0x4
        EA::Reflection::Float DECEL_GINSUMix_S_RPM;   // offset 0x48, size 0x4
        EA::Reflection::UInt32 GINSU_Decel_MaxRPM;    // offset 0x4c, size 0x4
        EA::Reflection::Float GINSU_DECEL_FADE_IN;    // offset 0x50, size 0x4
        EA::Reflection::Float Priority;               // offset 0x54, size 0x4
        EA::Reflection::Float GINSU_DECEL_FADE_OUT;   // offset 0x58, size 0x4
        EA::Reflection::UInt32 GinsuDecelVol;         // offset 0x5c, size 0x4
        EA::Reflection::UInt32 GINSU_Decel_MinRPM;    // offset 0x60, size 0x4
        EA::Reflection::Float DecelDeltaRPMThreshold; // offset 0x64, size 0x4
        EA::Reflection::Float AEMSMix_S_RPM;          // offset 0x68, size 0x4
        EA::Reflection::Float Ginsu_ACL_Neg_L_RPM;    // offset 0x6c, size 0x4
        EA::Reflection::Float AEMSMix_L_RPM;          // offset 0x70, size 0x4
        EA::Reflection::UInt32 GINSUAccelVol;         // offset 0x74, size 0x4
        EA::Reflection::Float AccelDeltaRPMThreshold; // offset 0x78, size 0x4
        EA::Reflection::Float GINSUMix_S_RPM;         // offset 0x7c, size 0x4
        EA::Reflection::Float DECEL_GINSUMix_L_RPM;   // offset 0x80, size 0x4
        EA::Reflection::UInt32 AEMSVol;               // offset 0x84, size 0x4
        EA::Reflection::Float DECEL_AEMSMix_L_RPM;    // offset 0x88, size 0x4
        EA::Reflection::Float DECEL_AEMSMix_S_RPM;    // offset 0x8c, size 0x4
        EA::Reflection::Float GINSUMix_L_RPM;         // offset 0x90, size 0x4
        EA::Reflection::UInt32 CarID;                 // offset 0x94, size 0x4
        EA::Reflection::Float MinRPM;                 // offset 0x98, size 0x4
        EA::Reflection::Float MaxRPM;                 // offset 0x9c, size 0x4
        EA::Reflection::UInt16 Master_Vol;            // offset 0xa0, size 0x2
        EA::Reflection::Bool MaybeV8;                 // offset 0xa2, size 0x1
        EA::Reflection::Bool Tranny;                  // offset 0xa3, size 0x1
    };

    typedef EA::Reflection::Float TypeOf_AEMSMix_L_RPM;
    typedef EA::Reflection::Float TypeOf_AEMSMix_S_RPM;
    typedef EA::Reflection::UInt32 TypeOf_AEMSVol;
    typedef EA::Reflection::Float TypeOf_AccelDeltaRPMThreshold;
    typedef Attrib::StringKey TypeOf_BankName_auxRAM;
    typedef Attrib::StringKey TypeOf_BankName_mainRAM;
    typedef EA::Reflection::UInt32 TypeOf_CarID;
    typedef EA::Reflection::Text TypeOf_CollectionName;
    typedef EA::Reflection::Float TypeOf_DECEL_AEMSMix_L_RPM;
    typedef EA::Reflection::Float TypeOf_DECEL_AEMSMix_S_RPM;
    typedef EA::Reflection::UInt32 TypeOf_DECEL_AEMSVol;
    typedef EA::Reflection::Float TypeOf_DECEL_GINSUMix_L_RPM;
    typedef EA::Reflection::Float TypeOf_DECEL_GINSUMix_S_RPM;
    typedef EA::Reflection::Float TypeOf_DecelDeltaRPMThreshold;
    typedef EA::Reflection::Float TypeOf_DecelPitchOffset;
