#ifndef _attrib_gen_frontend_h
#define _attrib_gen_frontend_h

#include "Speed/Indep/Src/Misc/MWAttribUserTypes.h"

namespace Attrib {
namespace Gen {

struct frontend : Instance {
    struct _LayoutStruct {
        RefSpec cam_angle;                          // offset 0x0, size 0xc
        RefSpec default_car;                        // offset 0xc, size 0xc
        EA::Reflection::Text CollectionName;        // offset 0x18, size 0x4
        EA::Reflection::Float cam_damping;          // offset 0x1c, size 0x4
        EA::Reflection::Float cam_anim_speed;       // offset 0x20, size 0x4
        EA::Reflection::Float cam_fov;              // offset 0x24, size 0x4
        EA::Reflection::Float cam_blur;             // offset 0x28, size 0x4
        EA::Reflection::Float cam_lookat_x;         // offset 0x2c, size 0x4
        EA::Reflection::Float cam_lookat_y;         // offset 0x30, size 0x4
        EA::Reflection::Float cam_lookat_z;         // offset 0x34, size 0x4
        EA::Reflection::UInt32 region;              // offset 0x38, size 0x4
        EA::Reflection::Float cam_orbit_vertical;   // offset 0x3c, size 0x4
        EA::Reflection::UInt32 manufacturer;        // offset 0x40, size 0x4
        EA::Reflection::Float cam_roll_angle;       // offset 0x44, size 0x4
        EA::Reflection::Int32 cam_periods;          // offset 0x48, size 0x4
        EA::Reflection::Int32 Cost;                 // offset 0x4c, size 0x4
        EA::Reflection::Float cam_orbit_radius;     // offset 0x50, size 0x4
        EA::Reflection::Float cam_orbit_horizontal; // offset 0x54, size 0x4
        EA::Reflection::Bool IsCustomizable;        // offset 0x58, size 0x1
        EA::Reflection::UInt8 UnlockedAt;           // offset 0x59, size 0x1
        EA::Reflection::Bool cam_user_rotate;       // offset 0x5a, size 0x1
    };

    typedef eUnlockableEntity TypeOf_CarPartName;
    typedef EA::Reflection::Text TypeOf_CollectionName;
    typedef EA::Reflection::Int32 TypeOf_Cost;
    typedef EA::Reflection::Bool TypeOf_IsCustomizable;
    typedef EA::Reflection::Int8 TypeOf_NameId;
    typedef EA::Reflection::Float TypeOf_RapSheetRanks;
    typedef EA::Reflection::UInt8 TypeOf_UnlockedAt;
    typedef EA::Reflection::UInt32 TypeOf_WarningLevel;
    typedef RefSpec TypeOf_cam_angle;
    typedef EA::Reflection::Float TypeOf_cam_anim_speed;
    typedef EA::Reflection::Float TypeOf_cam_blur;
    typedef EA::Reflection::Float TypeOf_cam_damping;
    typedef EA::Reflection::Float TypeOf_cam_fov;
    typedef EA::Reflection::Float TypeOf_cam_lookat_x;
    typedef EA::Reflection::Float TypeOf_cam_lookat_y;
    typedef EA::Reflection::Float TypeOf_cam_lookat_z;
    typedef EA::Reflection::Float TypeOf_cam_orbit_horizontal;
