#ifndef _attrib_gen_pursuitlevels_h
#define _attrib_gen_pursuitlevels_h

#include "Speed/Indep/Src/Misc/MWAttribUserTypes.h"

namespace Attrib {
namespace Gen {

struct pursuitlevels : Instance {
    struct _LayoutStruct {
        Private _Array_cops;                               // offset 0x0, size 0x8
        CopCountRecord cops[3];                            // offset 0x8, size 0x48
        EA::Reflection::Float heliLOSdistance;             // offset 0x50, size 0x4
        EA::Reflection::Float roadblockhelichance;         // offset 0x54, size 0x4
        EA::Reflection::Float SirenMaxYelpTime;            // offset 0x58, size 0x4
        EA::Reflection::Float roadblockprobability;        // offset 0x5c, size 0x4
        EA::Reflection::Float MilestoneCompleteHeatAdjust; // offset 0x60, size 0x4
        EA::Reflection::Float SirenMaxScreamTime;          // offset 0x64, size 0x4
        EA::Reflection::Float SearchModeRoadblockChance;   // offset 0x68, size 0x4
        EA::Reflection::Float HeliFuelTime;                // offset 0x6c, size 0x4
        EA::Reflection::Int32 FullEngagementCopCount;      // offset 0x70, size 0x4
        EA::Reflection::Float TimeBetweenHeliActive;       // offset 0x74, size 0x4
        EA::Reflection::Float TimePerHeatLevel;            // offset 0x78, size 0x4
        EA::Reflection::Float SirenWailPeriod;             // offset 0x7c, size 0x4
        EA::Reflection::Float TimeBetweenCopSpawn;         // offset 0x80, size 0x4
        EA::Reflection::Float EventWinHeatAdjust;          // offset 0x84, size 0x4
        EA::Reflection::Int32 RepPointsPerMinute;          // offset 0x88, size 0x4
        EA::Reflection::Float SearchModeCityMPH;           // offset 0x8c, size 0x4
        EA::Reflection::Float evadetimeout;                // offset 0x90, size 0x4
        EA::Reflection::Float SearchModeHwyMPH;            // offset 0x94, size 0x4
        EA::Reflection::Float FullEngagementRadius;        // offset 0x98, size 0x4
        EA::Reflection::Int32 NumCopsToTriggerBackup;      // offset 0x9c, size 0x4
        EA::Reflection::Float BackupCallTimer;             // offset 0xa0, size 0x4
        EA::Reflection::Float SirenInitVariation;          // offset 0xa4, size 0x4
        EA::Reflection::Float EvadeSuccessHeatAdjust;      // offset 0xa8, size 0x4
        EA::Reflection::Float SirenInitMinPeriod;          // offset 0xac, size 0x4
        EA::Reflection::Float frontLOSdistance;            // offset 0xb0, size 0x4
        EA::Reflection::Float TimeToHideInZone;            // offset 0xb4, size 0x4
        EA::Reflection::Float rearLOSdistance;             // offset 0xb8, size 0x4
        EA::Reflection::Float SirenScreamPeriod;           // offset 0xbc, size 0x4
        EA::Reflection::Float SearchModeRoadblockRadius;   // offset 0xc0, size 0x4
    };

    typedef EA::Reflection::Float TypeOf_BackupCallTimer;
    typedef EA::Reflection::Float TypeOf_BoxinDuration;
    typedef EA::Reflection::Float TypeOf_BoxinTightness;
    typedef EA::Reflection::Float TypeOf_BustSpeed;
    typedef EA::Reflection::Int32 TypeOf_CTSFor911;
    typedef EA::Reflection::Float TypeOf_CollapseAggression;
    typedef EA::Reflection::Int32 TypeOf_CollapseInnerRadius;
    typedef EA::Reflection::Float TypeOf_CollapseOuterRadius;
    typedef EA::Reflection::Float TypeOf_CollapseSpeed;
    typedef CopFormationRecord TypeOf_CopFormations;
    typedef EA::Reflection::Float TypeOf_DestroyCopBonusTime;
    typedef EA::Reflection::Float TypeOf_EvadeSuccessHeatAdjust;
    typedef EA::Reflection::Float TypeOf_EventWinHeatAdjust;
    typedef EA::Reflection::Int32 TypeOf_FullEngagementCopCount;
    typedef EA::Reflection::Float TypeOf_FullEngagementRadius;
