#ifndef _attrib_gen_pvehicle_h
#define _attrib_gen_pvehicle_h

#include "Speed/Indep/Src/Misc/MWAttribUserTypes.h"

namespace Attrib {
namespace Gen {

struct pvehicle : Instance {
    struct _LayoutStruct {
        UMath::Vector4 TENSOR_SCALE;                 // offset 0x0, size 0x10
        Attrib::StringKey MODEL;                     // offset 0x10, size 0x10
        EA::Reflection::Text DefaultPresetRide;      // offset 0x20, size 0x4
        EA::Reflection::Text CollectionName;         // offset 0x24, size 0x4
        EA::Reflection::Int32 engine_upgrades;       // offset 0x28, size 0x4
        EA::Reflection::Int32 transmission_upgrades; // offset 0x2c, size 0x4
        EA::Reflection::Int32 nos_upgrades;          // offset 0x30, size 0x4
        EA::Reflection::Int32 brakes_upgrades;       // offset 0x34, size 0x4
        EA::Reflection::Float MASS;                  // offset 0x38, size 0x4
        EA::Reflection::Int32 tires_upgrades;        // offset 0x3c, size 0x4
        Csis::Type_car_type VerbalType;              // offset 0x40, size 0x4
        EA::Reflection::Int32 induction_upgrades;    // offset 0x44, size 0x4
        EA::Reflection::Int32 chassis_upgrades;      // offset 0x48, size 0x4
        EA::Reflection::UInt8 HornType;              // offset 0x4c, size 0x1
        EA::Reflection::UInt8 TrafficEngType;        // offset 0x4d, size 0x1
    };

    typedef Attrib::StringKey TypeOf_BEHAVIOR_MECHANIC_AUDIO;
    typedef Attrib::StringKey TypeOf_BEHAVIOR_MECHANIC_DAMAGE;
    typedef Attrib::StringKey TypeOf_BEHAVIOR_MECHANIC_DRAW;
    typedef Attrib::StringKey TypeOf_BEHAVIOR_MECHANIC_EFFECTS;
    typedef Attrib::StringKey TypeOf_BEHAVIOR_MECHANIC_ENGINE;
    typedef Attrib::StringKey TypeOf_BEHAVIOR_MECHANIC_INPUT;
    typedef Attrib::StringKey TypeOf_BEHAVIOR_MECHANIC_RESET;
    typedef Attrib::StringKey TypeOf_BEHAVIOR_MECHANIC_RIGIDBODY;
    typedef Attrib::StringKey TypeOf_BEHAVIOR_MECHANIC_SUSPENSION;
    typedef Attrib::StringKey TypeOf_BEHAVIOR_ORDER;
    typedef Attrib::StringKey TypeOf_CLASS;
    typedef EA::Reflection::Text TypeOf_CollectionName;
    typedef EA::Reflection::Text TypeOf_DefaultPresetRide;
    typedef Attrib::StringKey TypeOf_EventSequencer;
    typedef EA::Reflection::Float TypeOf_HandlingRating;
