#ifndef _attrib_gen_speechtune_h
#define _attrib_gen_speechtune_h

#include "Speed/Indep/Src/Misc/MWAttribUserTypes.h"

namespace Attrib {
namespace Gen {

struct speechtune : Instance {
    struct _LayoutStruct {
        Private _Array_PlayerSmashSpeedRange;                // offset 0x0, size 0x8
        EA::Reflection::Float PlayerSmashSpeedRange[2];      // offset 0x8, size 0x8
        Private _Array_PursuitInactivityTimer;               // offset 0x10, size 0x8
        EA::Reflection::Float PursuitInactivityTimer[3];     // offset 0x18, size 0xc
        UMath::Vector2 SpeechDropoffRamp;                    // offset 0x24, size 0x8
        EA::Reflection::Float OutcomeFailSpeed;              // offset 0x2c, size 0x4
        EA::Reflection::Float MinIntensitySideswipe;         // offset 0x30, size 0x4
        EA::Reflection::Float SpeedDiffForBlowby;            // offset 0x34, size 0x4
        EA::Reflection::Float BlowbyInterval;                // offset 0x38, size 0x4
        EA::Reflection::Float HangTimeForCommentary;         // offset 0x3c, size 0x4
        EA::Reflection::Float BURemindTime;                  // offset 0x40, size 0x4
        EA::Reflection::Float AIRacerProximity;              // offset 0x44, size 0x4
        EA::Reflection::Float MinIntensityCopSmash;          // offset 0x48, size 0x4
        EA::Reflection::Float MaxRangeFor180;                // offset 0x4c, size 0x4
        EA::Reflection::Float MaxRangeForPrimaryBranch;      // offset 0x50, size 0x4
        EA::Reflection::Float MinIntensityTrafficSmash;      // offset 0x54, size 0x4
        EA::Reflection::Float MinPursuitDurationForBailouts; // offset 0x58, size 0x4
        EA::Reflection::Float FlipTimeForCommentary;         // offset 0x5c, size 0x4
        EA::Reflection::Float PriorityWeight;                // offset 0x60, size 0x4
        EA::Reflection::Float OutcomeTrackTime;              // offset 0x64, size 0x4
        EA::Reflection::Float RangeForSpotterBranch;         // offset 0x68, size 0x4
        EA::Reflection::Float RBOutcomeTimer;                // offset 0x6c, size 0x4
        EA::Reflection::Float SpeedThreshFlyFlipIntensity;   // offset 0x70, size 0x4
        EA::Reflection::Float PursuitInitDelay;              // offset 0x74, size 0x4
        EA::Reflection::Float TimeWaitForSpotterReply;       // offset 0x78, size 0x4
        EA::Reflection::Float TimeConsideredLostNoLOS;       // offset 0x7c, size 0x4
        EA::Reflection::Float RBPostOutcomeResetTime;        // offset 0x80, size 0x4
        EA::Reflection::Float MinHeightAirborne;             // offset 0x84, size 0x4
        EA::Reflection::Int32 MinHavocForSuspectBehavior;    // offset 0x88, size 0x4
        EA::Reflection::Float MinSpeedConsideredStopped;     // offset 0x8c, size 0x4
        EA::Reflection::Float MinTimeConsideredStopped;      // offset 0x90, size 0x4
        EA::Reflection::Float PursuitDurationHighIntensity;  // offset 0x94, size 0x4
        EA::Reflection::Float CrashSlowdownPct;              // offset 0x98, size 0x4
        EA::Reflection::Float MinHealthForCommentary;        // offset 0x9c, size 0x4
        EA::Reflection::Float CollisionMinClosingVelSq;      // offset 0xa0, size 0x4
        EA::Reflection::Float MaxTimeFor180;                 // offset 0xa4, size 0x4
        EA::Reflection::Float SuspectOutrunRange;            // offset 0xa8, size 0x4
        EA::Reflection::Float NoLOSCommentaryTime;           // offset 0xac, size 0x4
        EA::Reflection::Int8 HighIntensityMark;              // offset 0xb0, size 0x1
        EA::Reflection::Int8 MinContigFramesFor180;          // offset 0xb1, size 0x1
    };

    typedef EA::Reflection::Float TypeOf_AIRacerProximity;
    typedef EA::Reflection::Float TypeOf_BURemindTime;
    typedef EA::Reflection::Float TypeOf_BlowbyInterval;
    typedef UMath::Vector2 TypeOf_CacheDisplayCoords;
    typedef EA::Reflection::Float TypeOf_CollisionMinClosingVelSq;
    typedef EA::Reflection::Float TypeOf_CrashSlowdownPct;
    typedef EA::Reflection::Float TypeOf_FlipTimeForCommentary;
    typedef EA::Reflection::Float TypeOf_HangTimeForCommentary;
    typedef EA::Reflection::Int8 TypeOf_HighIntensityMark;
    typedef EA::Reflection::Float TypeOf_MaxRangeFor180;
    typedef EA::Reflection::Float TypeOf_MaxRangeForPrimaryBranch;
    typedef EA::Reflection::Float TypeOf_MaxTimeFor180;
    typedef EA::Reflection::Int8 TypeOf_MinContigFramesFor180;
    typedef EA::Reflection::Int32 TypeOf_MinHavocForSuspectBehavior;
