#include "Speed/Indep/Src/Sim/Simulation.h"
#include "Speed/Indep/Libs/Support/Utility/UCOM.h"
#include "Speed/Indep/Libs/Support/Utility/UListable.h"
#include "Speed/Indep/Libs/Support/Utility/UMath.h"
#include "Speed/Indep/Libs/Support/Utility/UTypes.h"
#include "Speed/Indep/Src/AI/AITarget.h"
#include "Speed/Indep/Src/Ecstasy/Ecstasy.hpp"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/controller.h"
#include "Speed/Indep/Src/Generated/AttribSys/Classes/system.h"
#include "Speed/Indep/Src/Generated/Events/ESimulate.hpp"
#include "Speed/Indep/Src/Input/ActionQueue.h"
#include "Speed/Indep/Src/Input/IFeedBack.h"
#include "Speed/Indep/Src/Interfaces/ITaskable.h"
#include "Speed/Indep/Src/Interfaces/SimActivities/IActivity.h"
#include "Speed/Indep/Src/Interfaces/SimEntities/IPlayer.h"
#include "Speed/Indep/Src/Interfaces/Simables/ICollisionBody.h"
#include "Speed/Indep/Src/Interfaces/Simables/IDisposable.h"
#include "Speed/Indep/Src/Interfaces/Simables/IINput.h"
#include "Speed/Indep/Src/Interfaces/Simables/ISimable.h"
#include "Speed/Indep/Src/Main/EventSequencer.h"
#include "Speed/Indep/Src/Main/Scheduler.h"
#include "Speed/Indep/Src/Math/SimRandom.h"
#include "Speed/Indep/Src/Misc/Platform.h"
#include "Speed/Indep/Src/Misc/Profiler.hpp"
#include "Speed/Indep/Src/Physics/Behaviors/RigidBody.h"
#include "Speed/Indep/Src/Physics/Behaviors/SimpleRigidBody.h"
#include "Speed/Indep/Src/Physics/PhysicsObject.h"
#include "Speed/Indep/Src/Sim/Collision.h"
#include "Speed/Indep/Src/Sim/SimActivity.h"
#include "Speed/Indep/Src/Sim/SimEntity.h"
#include "Speed/Indep/Src/Sim/SimModel.h"
#include "Speed/Indep/Src/Sim/SimProfile.h"
#include "Speed/Indep/Src/Sim/SimSubSystem.h"
#include "Speed/Indep/Src/Sim/SimTypes.h"
#include "Speed/Indep/Src/World/TrackStreamer.hpp"
#include "Speed/Indep/Src/World/WGridManagedDynamicElem.h"
#include "Speed/Indep/Src/World/WTrigger.h"
#include "Speed/Indep/bWare/Inc/bMath.hpp"

#include <types.h>

#include <algorithm>
#include <vector>

DECLARE_VECTOR_TYPE(CollisionListener);
DECLARE_VECTOR_TYPE(CollisionParticipant);

class SimSystem;

namespace Sim {

void ProfileTask(HSIMTASK htask, const char *name);

void SubSystem::ValidateHeap(bool before, bool initializing) {}

namespace Internal {

static float mProfileTime;
static int mCallCount;
static unsigned int mTick;
static unsigned int mRenderFrame = 0;
static float mFrameTime = 0.0f;
static float mTime;
static void *mWorkspace = nullptr;
static void *mStackFrame = nullptr;
static SimSystem *mSystem;
static eUserMode mUserMode = USER_SINGLE;

void InitTimers() {
    mFrameTime = 0.0f;
    mRenderFrame = eGetFrameCounter();
    mTime = 0;
    mTick = 0;
}

// TODO right place? or more down in the file?
// total size: 0x24
struct CDispatcher : public UTL::Collections::Singleton<CDispatcher> {
    // total size: 0x10
    struct Node {
        // total size: 0x8
        struct Timing {
            Timing(const char *who) : ID(who), HWM(0.0f) {}

            const char *ID; // offset 0x0, size 0x4
            float HWM;      // offset 0x4, size 0x4
        };

        Node(HSIMABLE participant, Collision::IListener *listener, const char *who)
            : Participant(participant), //
              Listener(listener),       //
              mTiming(who) {}

        bool operator<(const Node &rhs) const {
            return Participant < rhs.Participant;
        }

        void Respond(const COLLISION_INFO &cinfo) {
            Listener->OnCollision(cinfo);
        }

        HSIMABLE Participant;           // offset 0x0, size 0x4
        Collision::IListener *Listener; // offset 0x4, size 0x4
        Timing mTiming;                 // offset 0x8, size 0x8
    };
    // total size: 0x8
    struct Finder {
        Finder(HSIMABLE participant, Collision::IListener *listener)
            : Participant(participant), //
              Listener(listener) {}

        bool operator()(const Node &h) const {
            return (!Listener || Listener == h.Listener) && (!Participant || Participant == h.Participant);
        }

        HSIMABLE Participant;           // offset 0x0, size 0x4
        Collision::IListener *Listener; // offset 0x4, size 0x4
    };

    void *operator new(std::size_t size) {
        return gFastMem.Alloc(size, nullptr);
    }

    void operator delete(void *mem, std::size_t size) {
        if (mem) {
            gFastMem.Free(mem, size, nullptr);
        }
    }

    CDispatcher() {
        mParticpants.reserve(160); // TODO magic
        mList.reserve(256);        // TODO magic
    }

    ~CDispatcher() {}

    void Profile() {}

    void Respond(HSIMABLE participant, const COLLISION_INFO &cinfo) {
        Node pair(participant, nullptr, nullptr);
        List::iterator iter = std::lower_bound(mList.begin(), mList.end(), pair);
        for (; iter != mList.end(); ++iter) {
            Node &node = *iter;
            if (node.Participant != participant) {
                break;
            }
            node.Respond(cinfo);
        }
    }

    bool FindListener(Collision::IListener *listener, HSIMABLE participant) const {
        List::const_iterator iter = std::find_if(mList.begin(), mList.end(), Finder(participant, listener));
        return iter != mList.end();
    }

    void AddListener(Collision::IListener *listener, HSIMABLE participant, const char *who) {
        Participants::iterator piter = std::lower_bound(mParticpants.begin(), mParticpants.end(), participant);
        if (!FindListener(listener, participant)) {
            Node pair(participant, listener, who);
            mList.insert(std::upper_bound(mList.begin(), mList.end(), pair), pair);
        }
    }

    void RemoveListener(Collision::IListener *listener, HSIMABLE participant) {
        List::iterator newend = std::remove_if(mList.begin(), mList.end(), Finder(participant, listener));
        if (newend != mList.end()) {
            mList.erase(newend, mList.end());
        }
    }

    void RemoveParticipant(HSIMABLE participant) {
        Participants::iterator piter = std::lower_bound(mParticpants.begin(), mParticpants.end(), participant);
        mParticpants.erase(piter);

        List::iterator newend = std::remove_if(mList.begin(), mList.end(), Finder(participant, nullptr));
        if (newend != mList.end()) {
            mList.erase(newend, mList.end());
        }
    }

    void AddParticipant(HSIMABLE participant) {
        mParticpants.insert(std::upper_bound(mParticpants.begin(), mParticpants.end(), participant), participant);
    }

    typedef UTL::Std::vector<Node, _type_CollisionListener> List;
    typedef UTL::Std::vector<HSIMABLE, _type_CollisionParticipant> Participants;

    Participants mParticpants; // offset 0x4, size 0x10
    List mList;                // offset 0x14, size 0x10
};

}; // namespace Internal

}; // namespace Sim

class SimTask : public UTL::Collections::Countable<SimTask> {
  public:
    enum eFlags {
        ModeFlags = 15,
        DirtyFlag = 16,
    };

    static void UpdateAll(float dT_sim, float dT_render);

    SimTask(unsigned int priority, float rate, Sim::ITaskable *handler, float start_offset, Sim::TaskMode mode);
    ~SimTask();
    void Run(float dT_sim, float dT_render);

    void *operator new(std::size_t size) {
        return gFastMem.Alloc(size, nullptr);
    }

    void operator delete(void *mem, std::size_t size) {
        if (mem) {
            gFastMem.Free(mem, size, nullptr);
        }
    }

    static SimTask *FindInstance(HSIMTASK htask) {
        SimTask *p = mRoot;
        while (p) {
            if (p->mHandle == htask) {
                return p;
            }
            p = p->mTail;
        }
        return nullptr;
    }

    void SetRate(float r) {
        mRate = r;
    }

    static void Shutdown() {
        SimTask *p = mRoot;
        while (p) {
            SimTask *next = p->mTail;
            delete p;
            p = next;
        }
    }

    static void Collect() {
        SimTask *p = mRoot;
        while (p) {
            SimTask *next = p->mTail;
            if (p->IsDirty()) {
                delete p;
            }
            p = next;
        }
    }

    HSIMTASK GetInstanceHandle() const {
        return mHandle;
    }

    bool IsDirty() const {
        return mFlags & DirtyFlag;
    }

    void Release() {
        mFlags |= DirtyFlag;
    }

    Sim::TaskMode GetMode() const {
        return static_cast<Sim::TaskMode>(mFlags & 0xF);
    }

  private:
    void Link();
    void UnLink();

    static unsigned int mNextHandle;
    static SimTask *mRoot;

    float mRate;              // offset 0x4, size 0x4
    Sim::ITaskable *mHandler; // offset 0x8, size 0x4
    float mUpdate;            // offset 0xC, size 0x4
    unsigned int mPriority;   // offset 0x10, size 0x4
    SimTask *mHead;           // offset 0x14, size 0x4
    SimTask *mTail;           // offset 0x18, size 0x4
    unsigned int mFlags;      // offset 0x1C, size 0x4
    float mTimeBank;          // offset 0x20, size 0x4
    HSIMTASK mHandle;         // offset 0x24, size 0x4
    HSIMPROFILE mProfile;     // offset 0x28, size 0x4
};

// UNSOLVED
SimTask::SimTask(unsigned int priority, float rate, Sim::ITaskable *handler, float start_offset, Sim::TaskMode mode)
    : mRate(UMath::Min(rate, 1.0f)), mHandle((HSIMTASK)SimTask::mNextHandle), mHandler(handler), mUpdate(-start_offset), mPriority(priority),
      mFlags(mode & ModeFlags), mTimeBank(0.0f), mHead(nullptr), mTail(nullptr), mProfile(nullptr) {
    SimTask::mNextHandle++;
    Link();
}

// UNSOLVED, probably wrong functionally, the branching is annoying
void SimTask::Link() {
    if (!mRoot) {
        mRoot = this;
        return;
    }
    SimTask *p = mRoot;
    while (mPriority > p->mPriority) {
        p = p->mTail;
        mTail = p;
        mHead = p->mHead;
        if (p == mRoot) {
            mRoot = this;
        }
        if (mHead) {
            mHead->mTail = this;
        }
        if (mTail) {
            mTail->mHead = this;
            return;
        }
        if (!p->mTail) {
            mHead = p;
            p->mTail = this;
            return;
        }
    }
}

void SimTask::UnLink() {
    if (mRoot == this) {
        mRoot = mTail;
    }
    if (mHead) {
        mHead->mTail = mTail;
    }
    if (mTail) {
        mTail->mHead = mHead;
    }
}

SimTask::~SimTask() {
    Sim::Profile::Release(mProfile);
    UnLink();
}

// UNSOLVED, should be functionally matching
void SimTask::Run(float dT_sim, float dT_render) {
    if (IsDirty() || mRate <= 0.0f) {
        return;
    }
    ProfileNode profile_node("TODO", 1);
    Sim::TaskMode mode = GetMode();

    if (mode == Sim::TASK_FRAME_FIXED) {
        mUpdate += mRate;
        if (mUpdate < 1.0f) {
            return;
        }
        Sim::Profile::Scope profile(mProfile);
        bool handled = mHandler->OnTask(GetInstanceHandle(), dT_sim / mRate);
        mUpdate -= 1.0f;
    } else {
        if (mode != Sim::TASK_FRAME_VARIABLE || dT_render <= 0.0f) {
            return;
        }
        mUpdate += mRate;
        mTimeBank += dT_render;
        if (mUpdate < 1.0f) {
            return;
        }
        Sim::Profile::Scope profile(mProfile);
        bool handled = mHandler->OnTask(GetInstanceHandle(), mUpdate);
        mTimeBank = 0.0f;
        mUpdate -= 1.0f;
    }
}

void SimTask::UpdateAll(float dT_sim, float dT_render) {
    SimTask *p = mRoot;
    unsigned int currentpriority;
    while (p) {
        p->Run(dT_sim, dT_render);
        p = p->mTail;
    }
}

// total size: 0x90
class SimSystem : public UTL::COM::Object, public Sim::ITaskable {
  public:
    SimSystem();
    float DistanceToCamera(const UMath::Vector3 &v) const;
    void RunAllTasks(float frame_time);
    void UpdateFrame();
    void PauseInput(bool bPaused);
    void SetState(Sim::State newstate);
    void ModifyTask(HSIMTASK hTask, float rate);
    HSIMTASK AddTask(const UCrc32 &schedule, float rate, ITaskable *handler, float start_offset, Sim::TaskMode mode);
    void RemoveTask(HSIMTASK hTask, ITaskable *handler);
    void Start(const UCrc32 objclass);

    void *operator new(std::size_t size) {
        return gFastMem.Alloc(size, nullptr);
    }

    void operator delete(void *mem, std::size_t size) {
        if (mem) {
            gFastMem.Free(mem, size, nullptr);
        }
    }

    float GetTimeStep() const {
        return mTimeStep;
    }

    float GetSpeed() const {
        return mSpeed;
    }

    Sim::State GetState() {
        return mState;
    }

    // Overrides
    // IUnknown
    ~SimSystem() override;

    // ITaskable
    bool OnTask(HSIMTASK htask, float dT) override;

  private:
    static void DoFetchInput(IInputPlayer *o) {
        return o->FetchInput();
    }

    void CollectGarbage();
    void FetchCameras();

    const float mScheduleStep;        // offset 0x18, size 0x4
    float mTimeStep;                  // offset 0x1C, size 0x4
    float mTargetSpeed;               // offset 0x20, size 0x4
    float mSpeed;                     // offset 0x24, size 0x4
    int mEvent;                       // offset 0x28, size 0x4
    Sim::State mState;                // offset 0x2C, size 0x4
    ESimulate::StaticData mEventData; // offset 0x30, size 0x8
    Sim::IActivity *mKernel;          // offset 0x38, size 0x4
    bool mInputPaused;                // offset 0x3C, size 0x1
    HSIMTASK mWorldUpdate;            // offset 0x40, size 0x4
    HSIMTASK mSimStart;               // offset 0x44, size 0x4
    HSIMTASK mSimEnd;                 // offset 0x48, size 0x4
    HSIMTASK mSimFrameEnd;            // offset 0x4C, size 0x4
    Attrib::Gen::system mAttribs;     // offset 0x50, size 0x14
    UMath::Vector4 mCameras[2];       // offset 0x64, size 0x20
    unsigned int mCameraTargets[2];   // offset 0x84, size 0x8
    HSIMPROFILE mTasksProfile;        // offset 0x8C, size 0x4
};

SimSystem::SimSystem()
    : UTL::COM::Object(3),                           //
      ITaskable(this),                               //
      mScheduleStep(Scheduler::Get().GetTimeStep()), //
      mState(Sim::STATE_NONE),                       //
      mKernel(nullptr),                              //
      mTargetSpeed(1.0f),                            //
      mSpeed(1.0f),                                  //
      mEvent(-1),                                    //
      mInputPaused(false),                           //
      mAttribs(0xeec2271a, 0, nullptr),              // "default"
      mTasksProfile(Sim::Profile::Create()) {
    mCameras[0] = mCameras[1] = UMath::Vector4::kZero;
    mCameraTargets[0] = mCameraTargets[1] = 0;
    mTimeStep = mScheduleStep;
    mEventData.fSim = this;
    mEventData.fEventID = 0x522d67db; // TODO magic
