#include "./EAXSOund.hpp"
#include "Speed/Indep/Src/EAXSound/CARSFX/SFXObj_NISStream.hpp"
#include "Speed/Indep/Src/EAXSound/CARSFX/SFXObj_Pathfinder.hpp"
#include "Speed/Indep/Src/EAXSound/Stream/EAXS_StreamManager.h"
#include "Speed/Indep/Src/EAXSound/States/Managers/STATEMGR_Base.hpp"
#include "Speed/Indep/Src/EAXSound/sfxctl/SFXCTL_NISReving.hpp"
#include "Speed/Indep/Src/Frontend/Database/FEDatabase.hpp"
#include "Speed/Indep/Src/Frontend/MenuScreens/Common/FEMenuScreen.hpp"
#include "Speed/Indep/Src/Gameplay/GRace.h"
#include "Speed/Indep/Src/Gameplay/GRaceDatabase.h"
#include "Speed/Indep/Src/Gameplay/GRaceStatus.h"
#include "Speed/Indep/Src/Generated/Messages/MControlPathfinder.h"
#include "Speed/Indep/Src/Main/Scheduler.h"
#include "Speed/Indep/Src/Misc/Config.h"
#include "Speed/Indep/Src/Misc/QueuedFile.hpp"
#include "Speed/Indep/Src/Sim/Simulation.h"
#include "Speed/Indep/Src/World/WorldConn.h"
#include "Speed/Indep/bWare/Inc/Strings.hpp"
#include "Speed/Indep/bWare/Inc/bDebug.hpp"

enum SpeechModuleIndex {
    NISSFX_MODULE = 0,
    COPSPEECH_MODULE = 1,
    NUM_SPEECH_MODULES = 2,
};

enum eSFXOBJ_MAIN_TYPES {
    SFXOBJ_MUSIC = 0,
    SFXOBJ_SPEECH = 1,
    SFXOBJ_AMBIENCE = 2,
    SFXOBJ_MOVIES = 3,
    SFXOBJ_COMMON = 4,
    SFXOBJ_NISPROJ_STRMS = 5,
    SFXOBJ_MOMENT_STRMS = 6,
    SFXOBJ_FEHUD = 7,
};

namespace Speech {
struct Cache {
    void Dump();
    void Init(int size);
    void Validate();
};
struct Module {
    virtual void ReleaseResource();
};
struct Manager {
    static void ClearPlayback();
    static void Init(int mode);
    static void Destroy();
    static void Deduce();
    static void Update(float dt);
    static Module *GetSpeechModule(int id);
    static void AttachSFXOBJ(SpeechModuleIndex module, SFX_Base *psb, eSFXOBJ_MAIN_TYPES type);
};
} // namespace Speech

extern Speech::Cache gSpeechCache;

namespace Sound {
enum Context {
    kRaceContext_QuickRace = GRace::kRaceContext_QuickRace,
    kRaceContext_TimeTrial = GRace::kRaceContext_TimeTrial,
    kRaceContext_Career = GRace::kRaceContext_Career,
    kRaceContext_Count = GRace::kRaceContext_Count,
};
}

#include "Speed/Indep/Src/EAXSound/EAXCommon.hpp"
#include "Speed/Indep/Src/EAXSound/EAXFrontEnd.hpp"

struct EAXSND8Wrapper : public AudioMemBase {
    char *m_pSoundHeap;   // offset 0x04
    char *m_pStreamBuff;  // offset 0x08
    int m_nHeapSize;      // offset 0x0C
    int m_nStreamSize;    // offset 0x10
    eSndAudioMode m_eCurrentAudioMode; // offset 0x14
    eSndAudioMode m_eLastAudioMode;    // offset 0x18

    EAXSND8Wrapper();
    virtual ~EAXSND8Wrapper();
    bool Initialize();
    eSndAudioMode GetDefaultPlatformAudioMode();
    eSndAudioMode SetAudioModeFromMemoryCard(eSndAudioMode mode);
    eSndAudioMode SetAudioRenderMode(eSndAudioMode mode);
    void ReInit();
    eSndAudioMode SetSnd8RenderMode(eSndAudioMode mode);
    void Update();
    void STUPID();
};

struct stSndDataLoadParams {
    /* 0x00 */ char _pad0[0x34];
    /* 0x34 */ int Handle;
    /* 0x38 */ int bResolvedAsync;
    /* 0x3c */ int bResolvedSync;
    /* 0x40 */ char _pad40[0x20];
    /* 0x60 */ int t_req;
    /* 0x64 */ int t_load;

    void Clear();
};

struct stAssetDescription;
struct stSndAssetQueue;

enum eBANK_SLOT_TYPE {
    eBANK_SLOT_NONE = -1,
    eBANK_SLOT_AI_AEMS_ENGINE = 0,
    eBANK_SLOT_AI_GINA_ENGINE = 1,
    eBANK_SLOT_AI_GIND_ENGINE = 2,
    eBANK_SLOT_PATHFINDER = 3,
    eBANK_SLOT_MAX_NUM = 4
};

enum eEVTSYS {
    EVTSYS_MAIN = 0,
    EVTSYS_FE = 1,
};

enum eSNDDATAPATH {
    SNDPATH_EVTSYS = 0,
    SNDPATH_GLOBAL = 1,
    SNDPATH_INGAME = 2,
    SNDPATH_ENGINE = 3,
    SNDPATH_FXEDIT = 4,
};

enum eSNDDATATYPE {
    EAXSND_DT_INVALID = 0,
    EAXSND_DT_AEMS_MAINMEM = 1,
    EAXSND_DT_GENERIC_DATA = 2,
    EAXSND_DT_AEMS_ASYNCSPUMEM = 3,
};

struct stBankSlot {
    /* 0x00 */ eBANK_SLOT_TYPE Type;
    /* 0x04 */ int BANKmemLocation;
    /* 0x08 */ char *MAINmemLocation;
    /* 0x0c */ char *pLastAlloc;
    /* 0x10 */ int MAINmemSize;
    /* 0x14 */ int BANKMemSize;
    /* 0x18 */ int LoadFailed;
    /* 0x1c */ unsigned char Index;
    /* 0x20 */ stSndDataLoadParams *pAssetParams;

    void Clear();
};

struct EAXAemsManager : public AudioMemBase {
    static int m_RequiredSlots[4];
    static int m_SlotSizes[4][2];

    /* 0x004 */ char _pad0[0x9c - 0x4];
    /* 0x09c */ int m_nCurLoadedBankIndex;
    /* 0x0a0 */ int m_nEndOfList;
    /* 0x0a4 */ char _pad0xA4[0x10];
    /* 0x0b4 */ int m_SPUMainAllocsEnd;
    /* 0x0b8 */ int m_SPU_UpperAddress;
    /* 0x0bc */ char _pad0a[0xF8 - 0xbc]; // padding to m_pEvtSystems
    /* 0x0f8 */ void **m_pEvtSystems_start;
    /* 0x0fc */ void **m_pEvtSystems_end;
    /* 0x100 */ void **m_pEvtSystems_end_of_storage;
    /* 0x104 */ char _pad1[0x10]; // skip to m_nCallbackEvtSys
    /* 0x114 */ int m_nCallbackEvtSys;
    /* 0x118 */ stSndDataLoadParams *m_pCurLoadSDLP;
    /* 0x11c */ stSndDataLoadParams *m_pCurUNLOADSDLP;
    /* 0x120 */ stSndDataLoadParams *m_pAsyncLoadSDLP;
    /* 0x124 */ int m_ItemsPendingAsyncResolve;
    /* 0x128 */ char _pad0x128[0x4];
    /* 0x12c */ int m_IsWaitingForFileCB;

    EAXAemsManager();
    virtual ~EAXAemsManager();
    void Init();
    int AddEventSystem(eEVTSYS eESIndex, eSNDDATAPATH eSDP);
    int InitiateLoad();
    void SetupNextLoad();
    void Update();
    bool AreResourceLoadsPending();
    void *GetCallbackEventSys();
    static void EvtSysLoadCallback(int param, int error_status);
    void UnloadSndData(Attrib::StringKey filename);
    void UnloadSndData(int index);
    void RemoveAEMSBank();
    static void AddAemsBank();
    void CheckForCompleteAsyncLoad();
    void ResolvePendingAsyncLoads();
    void InitSPUram();
    void InitializeSlots(bool bDoPFSlot);
    void RegisterSlots(eBANK_SLOT_TYPE Type, int NumSlots, int SizePerSlotSPU, int SizePerSlotMainMem, bool bDoPFSlot);
    void ResetBankLoadParams();
    void RemoveBankListing(int index);
    int AddBankListing(stAssetDescription &asset);
    void QueueFileLoad(stSndAssetQueue &queueitem, eBANK_SLOT_TYPE SlotType);
    static void *AsyncResidentAllocCB(int size);
    static void *ResidentAllocCB(void *pbank, int residentsize, int totalsize);
    static void DataLoadCB(int param, int error_status);
    void DestroySlots(bool bDoPFSlot);
    int IsAssetInList(Attrib::StringKey filename);
    int IsAssetLoaded(Attrib::StringKey filename);
    void CompleteAsyncLoad();
    void ResolveCurrentDataMemory();
};

struct CarSoundConn : public Sim::Connection, public UTL::Collections::Listable<CarSoundConn, 10> {
    bool mConnected; // offset 0x14, size 0x1
    EAX_CarState *mState; // offset 0x18, size 0x4
    WorldConn::Reference mTarget; // offset 0x1C, size 0x10

    CarSoundConn(const Sim::ConnectionData &data);
    ~CarSoundConn() override;
    void OnReceive(Sim::Packet *) override;
    void OnClose() override;
    Sim::ConnStatus OnStatusCheck() override;
    void UpdateState(float dT);
    static Sim::Connection *Construct(const Sim::ConnectionData &data);
    static void SetAssetsLoaded(CarSoundConn *conn);
};

struct EAX_HeliState : public UTL::Collections::Listable<EAX_HeliState, 10> {
    bMatrix4 mMatrix; // offset 0x4
    bVector3 mVel0; // offset 0x44
    bVector3 mVel1; // offset 0x54
    bVector3 mAccel; // offset 0x64
    float mFWSpeed; // offset 0x74
    int mMovementMode; // offset 0x78
    int mPlayerZone; // offset 0x7C
    Attrib::Instance mAttributes; // offset 0x80
    Sound::Context mContext; // offset 0x94
    bool mSimUpdating; // offset 0x98
    char _pad_sim[3];
    const unsigned int mWorldID; // offset 0x9C

    EAX_HeliState(const Attrib::Collection *atr, unsigned int wuid);
};

struct HeliSoundConn : public Sim::Connection, public UTL::Collections::Listable<HeliSoundConn, 10> {
    EAX_HeliState *mState; // offset 0x18, size 0x4
    WorldConn::Reference mTarget; // offset 0x18, size 0x10

    HeliSoundConn(const Sim::ConnectionData &data);
    ~HeliSoundConn() override;
    void OnReceive(Sim::Packet *) override;
    void OnClose() override;
    Sim::ConnStatus OnStatusCheck() override;
    void UpdateState(float dT);
    static Sim::Connection *Construct(const Sim::ConnectionData &data);
};

struct CSTATEMGR_CarState : public CSTATEMGR_Base {
    static void ResolveCarBanks();
    static void ResetCarBanks();
    static void DestroyCar(EAX_CarState *pCar);
};

struct CSTATEMGR_AICar {
    static void QueueSlots();
};

enum eRaceMixType {
    eRACE_CIRCUIT = 0,
    eRACE_DRAG = 1,
    eRACE_TWODRG = 2,
    eRACE_TWOCIRC = 3,
};

struct NFSMixMaster {
    bool m_bMapReady;
    void CreateMainMainMap(eRaceMixType type);
    void DestroyMainMainMap();
    void InitMixMap(int mode);
    void ProcessMixMap(float dt, int cam_state);
};

struct EAX_CarState : public UTL::Collections::Listable<EAX_CarState, 10> {
    char _pad_context[0x20C];
    Sound::Context mContext;
    bool mSimUpdating; // offset 0x214
    char _pad_sim[3];
    bool mAssetsLoaded; // offset 0x218
    char _pad_assets[3];
    unsigned int mWorldID; // offset 0x21C
    HSIMABLE__ *mHandle; // offset 0x220
    unsigned int mTrailerID; // offset 0x224
    float mOversteer; // offset 0x228
    float mUndersteer; // offset 0x22C
    float mSlipAngle; // offset 0x230
    float mVisualRPM; // offset 0x234
    float mTimeSinceSeen; // offset 0x238
    int mNISCarID; // offset 0x23C
    float mDesiredSpeed; // offset 0x240
    int mControlSource; // offset 0x244

    EAX_CarState(const Attrib::Collection *atr, Sound::Context context, unsigned int wuid, HSIMABLE__ *handle);
};

template <>
UTL::Collections::Listable<CarSoundConn, 10>::List UTL::Collections::Listable<CarSoundConn, 10>::_mTable =
    UTL::Collections::Listable<CarSoundConn, 10>::List();
template <>
UTL::Collections::Listable<HeliSoundConn, 10>::List UTL::Collections::Listable<HeliSoundConn, 10>::_mTable =
    UTL::Collections::Listable<HeliSoundConn, 10>::List();
template <>
UTL::Collections::Listable<EAX_CarState, 10>::List UTL::Collections::Listable<EAX_CarState, 10>::_mTable =
    UTL::Collections::Listable<EAX_CarState, 10>::List();
template <>
UTL::Collections::Listable<EAX_HeliState, 10>::List UTL::Collections::Listable<EAX_HeliState, 10>::_mTable =
    UTL::Collections::Listable<EAX_HeliState, 10>::List();

extern EAXAemsManager gAEMSMgr;
extern unsigned int SoundRandomSeed;
extern float g_SliderValue;
