#include "Speed/Indep/Src/FEng/fengine_full.h"
#include "Speed/Indep/Src/FEng/FEJoyPad.h"
#include "Speed/Indep/Src/FEng/FEngStandard.h"
#include "Speed/Indep/Src/FEng/FEPackageReader.h"
#include "Speed/Indep/Src/FEng/FEGameInterface.h"
#include "Speed/Indep/Src/FEng/FEGroup.h"
#include "Speed/Indep/Src/FEng/FEListBox.h"
#include "Speed/Indep/Src/FEng/FECodeListBox.h"

// Callback structs used by both FEngine and FEPackage.
// Defined here because FEngine.cpp comes before FEPackage.cpp in the jumbo build.

// total size: 0x4
struct PackageInitStateCB : public FEObjectCallback {
    bool Callback(FEObject* pObj) override;
};

// total size: 0xC
struct FEFindByHash : public FEObjectCallback {
    unsigned long Hash;      // offset 0x4, size 0x4
    FEObject* pFound;        // offset 0x8, size 0x4

    bool Callback(FEObject* pObj) override;
};

// total size: 0xC
struct FEFindByGUID : public FEObjectCallback {
    unsigned long GUID;      // offset 0x4, size 0x4
    FEObject* pFound;        // offset 0x8, size 0x4

    bool Callback(FEObject* pObj) override;
};

// total size: 0x8
struct MouseStateObjectCounter : public FEObjectCallback {
    int NumMouseObjects;     // offset 0x4, size 0x4

    bool Callback(FEObject* pObj) override;
};

// total size: 0x8
struct MouseStateArrayBuilder : public FEObjectCallback {
    FEPackage* pPack;        // offset 0x4, size 0x4

    bool Callback(FEObject* pObj) override;
};

// total size: 0x8
struct MouseStateArrayOffsetUpdater : public FEObjectCallback {
    FEPackage* pPack;        // offset 0x4, size 0x4

    bool Callback(FEObject* pObj) override;
};

// total size: 0xC
struct ResourceConnector : public FEObjectCallback {
    FEPackage* pPack;                // offset 0x4, size 0x4
    FEResourceRequest** pReqList;    // offset 0x8, size 0x4

    bool Callback(FEObject* pObj) override;
    void ConnectListBoxResources(FEListBox* pList);
};

unsigned long FEngine::SysGUID;

FEngine::FEngine()
    : bExecuting(true) //
    , bMouseActive(false) //
    , bLoadObjectNames(false) //
    , bLoadScriptNames(false) //
    , pJoyPad(nullptr) //
    , FastRep(0) //
    , FastRepCache(0) //
    , PadHoldRegistered(0) //
    , WrapMode(kFBW_Wrap) //
    , NumJoyPads(0) //
    , pInterface(nullptr) //
    , CurrentPackageRecordIndex(0) //
    , NextButtonRecordIndex(0) //
    , bErrorScreenMode(false) //
    , bRenderedRecently(false) //
    , bDebugMessages(false) //
{
    bExecuting = true;
    bMouseActive = false;
    FEngMemSet(HoldDecrement, 0, sizeof(HoldDecrement));
    FEngMemSet(HeldButtons, 0, sizeof(HeldButtons));
    Sorter.Zero();
    FEngMemSet(RecordedPackageNames, 0, sizeof(RecordedPackageNames));
    NextButtonRecordIndex = 0;
    FEngMemSet(RecordedPackageButtons, 0, sizeof(RecordedPackageButtons));
    TypeLib.Startup();
}

void FEngine::SetNumJoyPads(unsigned char Count) {
    if (pJoyPad) {
        delete[] pJoyPad;
    }
    if (Count) {
        pJoyPad = new FEJoyPad[Count];
    }
    NumJoyPads = Count;
    FEngMemSet(HoldDecrement, 0, sizeof(HoldDecrement));
}

void FEngine::SetExecution(bool bProcessEverything) {
    FEPackage* pPack = PackList.GetFirstPackage();
    bExecuting = bProcessEverything;
    while (pPack) {
        pPack->bExecuting = bExecuting;
        pPack = pPack->GetNext();
    }
}

void FEngine::SetInitialState() {
    PackageInitStateCB cb;
    ForAllObjects(cb);
    unsigned char i = 0;
    while (i < NumJoyPads) {
        pJoyPad[i].Reset();
        i++;
    }
    if (bMouseActive) {
        Mouse.Reset();
    }
}

FEPackage* FEngine::FindIdlePackage(const char* pName) const {
    return static_cast<FEPackage*>(IdleList.FindNode(pName));
}

FEPackage* FEngine::FindPackageWithControl() {
    FEPackage* pPack = PackList.GetFirstPackage();
    while (pPack) {
        if (pPack->Controllers) {
            return pPack;
        }
        pPack = pPack->GetNext();
    }
    return nullptr;
}

bool FEngine::ForAllObjects(FEObjectCallback& Callback) {
    FEPackage* pPack = PackList.GetFirstPackage();
    while (pPack) {
        if (!pPack->ForAllObjects(Callback)) {
            return false;
        }
        pPack = pPack->GetNext();
    }
    return true;
}

// total size: 0x20
struct FEMessageNode : public FEMinNode {
    FEObject* pMsgFrom;         // offset 0xC, size 0x4
    FEObject* pMsgTarget;       // offset 0x10, size 0x4
    FEPackage* pFromPackage;    // offset 0x14, size 0x4
    unsigned long MsgID;        // offset 0x18, size 0x4
    unsigned long ControlMask;  // offset 0x1C, size 0x4

    inline ~FEMessageNode() override {}
};

// total size: 0x20
struct FEPackageCommand : public FENode {
    int iCommand;               // offset 0x14, size 0x4
    unsigned long uControlMask; // offset 0x18, size 0x4
    FEPackage* pPackage;        // offset 0x1C, size 0x4

    inline ~FEPackageCommand() override {}
};

void FEngine::SetProcessInput(FEPackage* pkg, bool bProcess) {
    if (!pkg) {
        return;
    }
    pkg->bInputEnabled = bProcess;
}

FEPackage* FEngine::GetFirstLibrary() const {
    return static_cast<FEPackage*>(LibraryList.GetHead());
}

void FEngine::AddToIdleList(FEPackage* pPack) {
    IdleList.AddNode(IdleList.GetTail(), pPack);
}

void FEngine::AddToLibraryList(FEPackage* pPack) {
    LibraryList.AddNode(LibraryList.GetTail(), pPack);
}

void FEngine::RemoveFromLibraryList(FEPackage* pPack) {
    LibraryList.RemNode(pPack);
}

FEPackage* FEngine::FindLibraryPackage(unsigned long NameHash) const {
    FEPackage* pPack = GetFirstLibrary();
    while (pPack) {
        if (FEHashUpper(pPack->pFilename + 2) == NameHash) {
            return pPack;
        }
        pPack = pPack->GetNext();
    }
    return nullptr;
}

